{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eNHZABmkbd-6S5WZtmXC8A", "review_id": "bt6DNIZBbADkWyCnygW7ng", "stars": 3, "date": "2007-09-25", "text": "Good food and great location.  I really enjoyed the Princeton athletic attire around the restaurant.  I came on a Sunday night, but looking from the walls of the bar area, there are some great specials on Tuesday or Monday nights!  Nothing AMAZING, but this is a great place to sit down and have dinner!", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "mYO_f9LkEybqZV3SUCKcLg", "review_id": "mDtiTqz8THjsM9jTtygu-g", "stars": 3, "date": "2008-09-05", "text": "This restaurant is very average, but I keep coming back for all the Princeton memorabilia on the walls.  It's standard American diner fare, and well executed, but nothing that sets it apart from other restaurants in Tigertown.\n\nThe service is quite good.  Few students come here except for the occasional birthday party, and the clientele at the bar seems to be 30- and 40-somethings.  For eating in Palmer Square, you could do worse, but you could do better too.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5dSxCFW9nBJhi-yt_3Px8g", "review_id": "wemXfL5G3dT07AhgoXiCQA", "stars": 3, "date": "2010-04-29", "text": "This is a pretty unique record store, but I couldn't help but feel trapped in this place there is so much stuff in this place and there's a lot of everything rocks, books, records, etc.... to much to list I felt like I was bumping into everything there but overall the store is pretty cool great help and things like a dead milkmen shirt that you can't find anywhere else in the area.", "type": "review", "business_id": "HPWmjuivv3xJ279qSVfNaQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_jqOM382Dhyqp2MN6A4t6g", "review_id": "NAyDx5oo6dMf-6ovO7VJjQ", "stars": 3, "date": "2009-08-07", "text": "I've been going to Winberie's for years, for several reasons: the laid back atmosphere when all you want to do is hang out with some friends and drink beers, the better than good American/burger cuisine, and the price.  If you're looking for yummy bar food in Princeton, Winberie's will definitely make you happy!", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pzyKIwEUp8axXqlRCUUfqg", "review_id": "QOXa2dVZlHJh-PrCMfX55A", "stars": 4, "date": "2010-09-09", "text": "My parents apparently went to this place a lot when they were first married for \"date night.\" I went here for lunch today with them. I got the \"You Pick Three\" which is a cup of soup, 1/2 a sandwich and your choice of french fries or salad. \n\nI chose creamy tomato soup, 1/2 a grilled cheese and french fries. What great comfort food! The tomato soup was delicious, nice and hot. The grilled cheese was crunchy and gooey and perfect for soup dipping. The fries were eh but always appreciated. :) My mom got the exact same lunch as me and my dad got the black and bleu burger. If food is good my dad doesn't talk and, as he didn't utter a word once the food arrived, I'm assuming it was yummy.\n\nSide note: We parked in front of The Bent Spoon and my mom even offered to buy me some but I wanted my first trip there to be with my fiance. How strong am I?", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tpxb4XDEW3HM8rO5gPiFDA", "review_id": "FP05gWT38dSTZ3qC4iZGhQ", "stars": 4, "date": "2012-03-24", "text": "I was starving when I walked in here.  And when I walked out... well I still had room for ice cream, but at least I was comforted by my meal here.  \n\nFrench Onion Soup: I rarely get soup unless it comes with the meal, but I couldn't wait till my main course to consume something.  It tasted nice once I managed to get each spoonful to be a consumable temperature.  I just feel like I've paid less for better french onion.\n\nChicken Fettuccine: I honestly loved it.  Good comfort food after a long day of commuting in traffic.  The walnut pieces I thought really went well with the cream sauce.   I got the small portion for some dumb reason so when I was done it left me wanting more.  I should of paid the extra $4 for the larger portion.  $15 bucks for a pasta dish is reasonable to me.  \n\nWaiter was good.  The only issue was my friend called and made a reservation and was told to call the day of.  Called that day and was told they don't take reservations.  Then while driving there was called and told the table was ready.  I was not aware of any if this until we got there and did not affect me at all.  We were a large party and was seated right away.  \n\nOnly issues that effected me were the loud dining room (I could not hear the people opposite to me) and the paper towel dispenser  didn't work (One of those dealys where you wave your hand over the sensor to get the paper towel, cept nothing came out).", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 4, "useful": 8, "cool": 4}, "user_id": "LYXc1p5VH4ny-KO2-W1_eQ", "review_id": "Q83UwOqhjAO23Jq4GJZHRw", "stars": 2, "date": "2008-05-26", "text": "UPDATE, 7/30/08:  I recently received a very nice note from JP himself through Yelp.  He informed me that their ISP has been out to rewire the shop since my review was written.  I have not been back to confirm this, but it's possible that the wifi problems I experienced have been fixed.  In fairness to them, I wanted to update my review with this information.  If I go back and find that the problem has been resolved, I'll be sure and update here again.\n---------\nI'm currently at Flipnotics, having just left JP Java because I could not get their freaking wi-fi to work, despite trying no less than 1,000,000 times over an hour period with several different programs and asking the poor dude behind the counter to reset their modem twice.  I know it wasn't just me, because several other people in there were having the same problem, and the first time I said something to the counter dude, he said, \"Sometimes you have to just keep trying...the connection is a little spotty.\"\n\nThis is a deal-breaker for me.  I don't generally go to coffee houses unless I plan to work.  Plus, how am I supposed to procrastinate on Yelp if I don't have wi-fi?  Duh.\n\nPlus, I *specifically* asked the guy before buying my $4 drink whether they had free wi-fi, and he issued no warning whatsoever about their spotty connection.  Grrrr.\n\nSo, I camped out for an hour nursing a drink I'd already purchased, grumbling to myself because I couldn't do what I'd come there to do.\n\nIf wi-fi isn't important to you, however, this place is pretty cool.  I loved the decor - a great mix of big, comfy, leather chairs and a pretty good amount of table seating, too (with padded chairs - thank you).  If you're using a laptop and need juice, do check for outlets before you choose a spot to sit, as some of the tables don't have outlets nearby.  They also have a nice little patio.  The music is a hair on the loud side for my taste, but again, I was there to work - if you're just visiting or are good at tuning out music, then it might be fine for you.\n\nI did like my iced chai, and liked that they offer thai tea, as well.  You can also \"frappe\" many of their drinks for an additional 60 cents, which means that they add a concoction of sugar and creamer that makes it all frothy and stuff.\n\nService was friendly and I noticed they carry breakfast tacos from Elsi's and paninis in addition to the usual selection of baked goods - something I always appreciate when I'm camping out somewhere for a while working.\n\nBut, like I said, lack of wi-fi is a dealbreaker for me.  Especially when I specifically ask first if they have it.\n\nFortunately, Flipnotics was right here for me, ready to catch me on the rebound.  I love you, Flipnotics.  I won't ever leave you again.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_vN1zUgCxvfVFabQJw5JvA", "review_id": "lEqLP62NSrmwng7_Z9XFMQ", "stars": 4, "date": "2006-03-01", "text": "Winberie's is a well-above average restaurant and bar in Princeton, NJ.  Located right in the heart of town, this hotspot is a favorite among locals and visitors alike.\r\n\r\nThis restaurant features a varied menu with a nice vegetarian selection.  My favorite item, however, must be the \"buffalo chicken strips\" appetizer.  Golly, it's good!\r\n\r\nExpect a wait on weekends as the place is usually packed.  Sit at the bar for better, faster service.\r\n\r\nRecommended.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GLP3Yeie2NGTzAsTfZojcQ", "review_id": "gWmmyJYlKB3L8eSo88Vxsw", "stars": 5, "date": "2007-01-27", "text": "I miss JP's Java.  I used to go here pretty much everyday when I was at UT.  During finals week they stay open extra late, which is a plus.  Their baristas are top notch and make yummy drinks.  The Toddy is tasty in the summer.\n\nTRIVIA: Zoka sources their beans from Zoka Coffee (Seattle-based), which is one of my favorite coffee shops here in Seattle.  Very nice!!", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8_PMjGVgQ5VFgcMMl4QtMg", "review_id": "Jz2RDI0TCOCU9HexodvWZw", "stars": 1, "date": "2011-10-24", "text": "Watch your credit card statements! \n\nA bartender attempted to cheat on a credit card tip (I signed for $6.50, and they gave themselves $10.00). If I had tried to walk out with paying, I would have been arrested. But according to the manager, when I called to complain, it was an honest mistake that the bartender made. It is implausible to mistake a 6 for a 10.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B5mpfVCviyUl9Bsdef5jUQ", "review_id": "aFIX3VXiHqf6FhGPPycvIw", "stars": 3, "date": "2011-02-17", "text": "Can't really beat the location of this bar/restaurant now.  The prices are fine for Princeton, especially being within Palmer Square.  \n\nI had dinner here for the first time last week, it was A-OK (like my rating suggests!).  Ordered some pasta with chicken - the dinner portion wasn't very large, it was most likely 4-6oz of pasta.  Not sure if the $18 price tag is warranted, considering pasta is so cheap...but whatever.\n\nI don't think I'd come back unless I had to, otherwise, it's just ok.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 5, "cool": 4}, "user_id": "EMn0Zzaijk2L-fyK2EtG8Q", "review_id": "i4MmdebvmiDooLqt5PLMMA", "stars": 4, "date": "2007-06-13", "text": "Best Latte in town.  They now have great coffee thanks to their new Clover machine.  The sandwiches are ok.  The desserts are from 1886, I have not had one, but I hear they're pretty good.  The baristas are sometimes in a good mood and sometimes they're not.  A bit expensive, but worth it anyways.  Did I say I think they have the best latte in town?  And that's all that matters to me.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6mrFK4e6oUBfebSlMCy21A", "review_id": "R7aUmle3CakTuL7B2BbRXQ", "stars": 2, "date": "2010-09-29", "text": "The coffee is good; the espresso is variable (sometimes drawn too slowly/too short.)  The latte art is very good.  Be attentive as drinks are not always called when they're served.  \n\nThe tea is very good.  \n\nAttitude of the morning employees is not very good, however it's nothing personal.  The A/C does not work and has not for several summers (bring fan.)  The lock on the men's restroom is periodically broken so knock first, unless you enjoy walking in on someone. \n\nPastries are very good.  \n\nInternet access is sporadic, probably because the access point is right behind the TV.  (It seems like all the electrical engineering profs who frequent the place would have said something about this.)  However it works fine in JP's office, so if he's not at the Posse you can check there in an emergency.  \n\nIf you like to smoke then this might be the place for you in wintertime; the patio features propane heaters which work well when there's propane.  \n\nParking is available across the street when the tiny lot is full.  Parking in the frat parking lot will get you towed instantly.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "x5GMzFRWm37_J5pEU9p5Eg", "review_id": "2eLsbKIX0LerVrQwH2z4FQ", "stars": 3, "date": "2008-12-12", "text": "This place isn't anything special, but we find ourselves going there a lot because its one of the most convenient when walking around Princeton- its not toooo stuffy (although its still in Princeton, so, you know...), never have to wait for a table and for our single friends there is usually a crowd of other singles for them to mingle (albeit, cramped mingling) with.  Beer isn't too expensive, appetizers are good for vegetarians although I don't think I've ordered anything but apps- I like the cheese dip with apples.  Overall,  its a pretty casual place thats nice and centrally located.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IaWYbkeRPHSyiMqB5VSf3g", "review_id": "xMqTPmywKr9vPetTGcUA6w", "stars": 5, "date": "2009-02-05", "text": "I wasn't sure where to start looking for place to rent intown- Cooper Brown had lots of rentals listed on their web site. When I narrowed it down to a few I wanted to see, they were accomodating about showing them when I had the time. The whole process was easy and straight forward. A top notch group to work with! I love living intown!", "type": "review", "business_id": "ZKcVHVlD-kwmXFlnPzxpMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V7J6mdryEdILbraeA7r5LA", "review_id": "WVKZxJC55yi5ySd4yIXP8g", "stars": 5, "date": "2011-01-03", "text": "Perfect hangout for those actually looking to study; very popular amongst the science/engineering/math crowd.  Solid coffee, tea, pastries, sandwiches, etc.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3XuxSvex3zN7IznwCmH5EA", "review_id": "mMCiArmJHaxZ-0MFf0Bq7Q", "stars": 3, "date": "2008-05-03", "text": "Great casusal place to grab dinner. There are lots of options on the menu and I love that even though it's a pub kind of place, they still have vegetarian options. \n\nTo me, this is the pefect place to grab a table with friends and catch up over food and drinks. Everyone can find something on the menu they are happy with and the waitstaff is friendly. My friends love the chocolate fondue for dessert.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KPiykM_x8L-UUKzojrpu_w", "review_id": "KzlLbY1r2nXgeVOxrcYpFw", "stars": 4, "date": "2008-02-10", "text": "Why: Best non-fat latte.\n\nGreat choice of coffee beans, and well trained baristas who know how to foam non-fat milk -- foam lasts till the last droplet of latte.  Parking sucks and your near campus.  Say goodbye to one of their best baristas though. \nNo worries. I found her hanging out with a Florentine family on West Lynn. ;)\n\nOnly shop is Austin who serves clover coffee.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ie3nXtDTyHhJchMuYh_WXQ", "review_id": "ixkjtQK5DdbH8TwXEVBpgg", "stars": 4, "date": "2010-08-09", "text": "Came here to take advantage of the free wi-fi as the Time Warner man still hadn't come to install my cable/ internet services. Ordered an iced coffee which was cold pressed and quite delicious (reminded me of Fair Grinds in New Orleans, quite possibly one of the best coffee houses in that city (http://www.yelp.com/biz/fair-grinds-coffee-house-new-orleans).)\n\nAnd the best part of it all was that I had Internet! Such a pleasure when I hadn't had it over a week. It's important to know that this place gets crowded ( I came here on a Monday afternoon around 3 and almost all of tables were taken). Moreover, everyone loves to talk here and talk loudly so I wouldn't consider this my first choice for the most apt place with which to study and get work done. \n\nNotwithstanding these minor inconveniences, I'll still frequent JP's Java because of its proximity to the law school and its delicious coffee.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YSygJSSbTPAeQuWIdybKlQ", "review_id": "oRs3bXuqRImAoU_hYDEKGQ", "stars": 5, "date": "2012-07-05", "text": "Came here on a Monday night for dinner, although I wasn't too hungry. I went down a few steps only to enter a noisy and dim area with a crowded bar and tables to the side. Our hostess seated us in the back and we were quickly greeted by our waitress. She got our drinks and gave us a few minutes to explore the menu. The variety is pretty good here- all American food with a few kicks. In the end, I opted for the chicken fettuccine while le petit ami ordered the Cajun macaroni and cheese. I was happy to find out that some of their dishes come in two sizes for those who wanted a lighter dinner, such as myself. The price difference was $4 dollars between the two sizes, which wasn't so bad. Our food came in about 15 minutes and was piping hot. My chicken fettuccine included spinach fettuccine in a creamy parmesan sauce with grilled chicken, tomatoes, mushrooms, and walnuts on tops. It was so savory and perfect in every way! The sauce wasn't too cheesy and complemented the grilled chicken just right. i usually don't like tomatoes, but since they were diced in this dish, I didn't mind them too much. As for the spinach fettuccine, it was cooked al dente- just the way I like it. My stomach was extremely content after i finished every last bit of my pasta. Mon petit ami also loved the Cajun macaroni and cheese, which had chicken, sausages, bacon, and scallions under a spicy tomato cream sauce and parmesan panko crumb topping. I had a bite of it. It wasn't too spicy and definitely changed my definition of macaroni and cheese. The crumb topping had a distinct texture, which was nice in the midst of all the pasta and different meats. Same went for the bacon. We were both impressed with Winberie's dishes and we hope to be back soon! Definitely going to try their desserts next time :)", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "62f7eUnn3O-RZPuSEdX95g", "review_id": "YHDbYQuI9eJB3X-z2Y_fCg", "stars": 2, "date": "2010-06-22", "text": "I went to JP's last night for the first time and it was purely for the wi-fi and the proximity to speedway. I would definitely say it's location is what makes it so popular. It was full of people studying, yet incredibly loud - but, as someone said, it isn't a library. Although I still felt a little rude to be one of the few not freaking out over a test and just talking to a friend. \n\nThe one major thing I noticed was how sloooooooow the barista was. I am all for slow food and the anti-starbuckian movements, but jesus! my friends latte took like ten minutes and no one was in front of us. Thank goodness I just ordered a delicious pastry.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zu0XNq8YnVBNFfRXuv727A", "review_id": "2brFXEBGBE9kmuNhIbx6Vw", "stars": 4, "date": "2012-02-19", "text": "I think J.B. Winberie's was the very first restaurant I visited in Princeton some 20 years ago while there visiting former student.  It struck me then, as it does now, as the quintessential Ivy League college town eatery/pub - somehow exactly what you would think that would be, with lot of wood, and that pub in the cellar sort of feel.  Was back, this time, to visit yet another student, so we stopped here for a quick meal on a Sunday evening.  Split a great salad and had a fabulous burger that was juicy and loaded with things that are particularly good for you. The menu is quite extensive, but with so many 'artsy' restaurants in the neighborhood, this doesn't seem like the place you'd want to go for chicken cordon blue.  (Not sure that was on the menu, but you get my drift.)   A really good sandwich, burger, and beer place is what THIS is.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LjYqwxwOzVnf6EuYUwuhQg", "review_id": "A-D5oBYsDo4SxAL3PqaMLA", "stars": 4, "date": "2011-09-17", "text": "JP's Java is a great place to go to drink coffee and get some work done on your computer.  It's quiet, comfortable, and laid-back.  The coffee is good, the snacks are yummy but on the pricey-side.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UuP5gkkFltjzcoAuFINHUw", "review_id": "-ZPWnCc8BHDrGhcfPFKSfA", "stars": 4, "date": "2011-09-05", "text": "I too have been coming here for years, although it's been a long time since the last time.  Great spot for a casual, yet good, bite to eat.  Good burgers and we are fans of the Irish nachos.  Good beer too.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7zvIwVHtMM0RW8hatGs6YQ", "review_id": "pBFTLZDBZ3jj7kseZ0EY1g", "stars": 2, "date": "2012-06-17", "text": "Blah. Food was underwhelming and expensive for what was received. Has a pretty cool interior, but bland food ensures that next time in Princeton I'll be going to get dinner someplace new.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mp68LGnhRbzCI57gkW1qGQ", "review_id": "UcOW5OqOZmVMH7IG9-s67g", "stars": 3, "date": "2010-10-25", "text": "It's fine.  Nothing special other than typical pub food.  The service is quite spotty.   Everything I've had is pretty tasty, but nothing blew me away.  One of the many \"fine but not fantastic\" places of this world.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1S-QLWu3H3aCbrWmCTtCbA", "review_id": "YosVXuqxLR7fqXB5ZA4krQ", "stars": 1, "date": "2012-06-29", "text": "I've been living in Princeton for the past two months for work. Every night we have been trying to find new places to go grap a post work cocktail and snack. Last week we stumbled upon winberies and it was perfect. I loved the Irish nachos and decent draft beer prices. Needless to say I started to plan another outing for our work group to go back and enjoy the happy hour that was advertised all over the bar. Upon arriving last night we waited for about 15 minutes without even a glance from the bartender so we thought we would try dining room seating. Waiting for another 10 minutes to find a ever so absent hostess we asked what I assume was the manager on duty if you had to purchase full meals to sit in the dining room or if just appitizers/drinks and asked if a small part of the dining room immediately behind the bar was bar seating. His response was rude, quick, and had an overall manner of inconvieniance. All three of my friends were SHOCKED that anyone working in the service industry would have that kind of nasty additude towards potential customers. After the rude manager quickly dismissed us we decided it would be better to go somewhere else for drinks if they were going to be so rude.  I don't think I'll be going back to winberies again after the way we were talked down to last night. Better luck giving my money to triumph brewery on Nassau street.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "R0KVWeN9xR-F6j4z5k9wXQ", "review_id": "_wa45lNELsIepfouibMt2w", "stars": 3, "date": "2007-01-22", "text": "I spent a lot of time here in law school and enjoyed studying on the patio with fresh air.  It is a nice change from the sterile library lights.  It is a chill, low key spot with a few tables, picnic benches and comfy chairs.  Parking, as usual, is terrible.  At the time when I used to frequent this shop, I was not a coffee junkee, so I usually got the sweet stuff that drowns out the coffee flavor and puts an extra few pounds on the arse.  Fortunately, my taste for coffee has changed but I still cannot testify to JP's quality.  I do know, however, that the staff was always friendly and accommodating.  \n\nBig con - if you are using a laptop, plugs are or at least use to be limited and require strategic placement in order to keep from clothes- lining other patrons.  Other than that, JP's is cool.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MKArnhRkRH6ZaoY1-21Y3A", "review_id": "jk3b3Jyzu-lo2YW9icU-Ow", "stars": 4, "date": "2012-03-28", "text": "I've been to Winberie's 5-6 times over the last 3-4 years.  I often pop in knowing I can get a cold beer and a decent meal.  Most of the time I sit at the bar, but did eat in the restaurant one night when the bar was full.  Service is always great at the bar and was acceptable though less notable in the restaurant.  I'm usually here during the week and some nights the bar area gets pretty packed, so I'm sure it's often busy during the weekend.  I would rate just about all of the meals I've had here as above average pub food.  I did get an average to slightly below average burger on one visit, but I've had the same meal (burger with brie) 2-3 other times and its been great.  I'm also a huge fan of the buffalo chicken tenders.  They actually pack some heat which is something so many \"hot\" wings/tenders seem to missing at a lot of the places I go.  I can also vouch for their dinner salads being more than enough to serve as a great meal.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aFlKAkig9Yk312cL7ZMiKg", "review_id": "uicTib0OsChq4sgq7A6XUQ", "stars": 4, "date": "2011-11-04", "text": "I used to come to JP's Java when it first opened roughly 10 yrs ago when I was an undergrad and this was my go to place to study. I recently came back to study for my grad classes and they made lots of improvements since then!\n\nI'm not a huge coffee drinker so I can't really tell whats good or not. I just drink the coffee to stay awake and no other purpose. I enjoy the atmosphere with random artwork on the walls and eclectic student population and others alike. Hipsterish crowd at times but what coffee shop isn't hipster-like unless you are called Starbucks. \n\nThe food is good...well specifically the roast beef and brie sandwich. Snack selection is fair with lots of pastries, but everything is generally pricey. They also have beer on tap...yes, beer at a coffee shop and I actually saw some people drinking while studying. I mean I like a good beer but while studying I'll fall asleep (definitely not what I want with a test the next day) Beer was a definite change from 10 yrs ago and I would have considered coming here for non studying purposes.\n\nFree wireless internet but its very erratic with constant disconnects every hour or two. It's good enough and pretty fast.\n\nParking is in a small lot with side street parking. Daytime is pretty easy to find parking.\n\nOutdoor patio is nice with large umbrellas to shade you from being burnt to crisp. In the summer it might be miserable and they might have fans? but I do remember them having portable heaters in the winters 10 yrs ago. I imagine they are still doing that but the weather in November is awesome to be outside.\n\nShout out to my old stomping grounds for studying.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XWnDoB40cZY9yDCGjCqUiA", "review_id": "or_TcPHVt78mAKB9DPAN2Q", "stars": 2, "date": "2011-01-17", "text": "We came as a group of 9 and were promised seating in \"about 20 to 30 minutes.\"  It was only 5pm so who would think an early bird group would be a problem.  The hostess was unaccommodating and seemed put out when  asked for an updated timeframe.  When finally seated almost 1.5 hours after arrival, the service was less than fair.  The waitress was very nice when you could find her.  Now for the food:  you would think after waiting that long, dog biscuits would have tasted good.  The soup was decent.  I sampled several of the entree salads from the table and all were insipid.  The lettuce mix was predominantly iceberg and the dressings were watery.  The best item was the plate of cheese fries.  We will never go back!", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-1_hWlxJbX-H-GbCJ0mgsQ", "review_id": "_h8ZNDvQy4GNTuBLM_Yq_w", "stars": 2, "date": "2009-05-23", "text": "I've been to Winberie a couple times and have never really been impressed. The food is on par with Chili's or TGI Fridays with a few slightly more creative menu touches and better beer and wine choices. Nothing ever tastes great, although nothing is ever bad either. It's consistently decent pub food. \n\nThe positives for Winberie are its great location (Palmer Square, right across from Princeton University), Princeton memorabilia (think Applebee's, except the junk on the wall is actually regionally-specific and carefully chosen), and unpretentious nature. Despite the close proximity to campus, this is generally not a place that students visit or hang out; the clientele is typically 30s+.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g3-4LSFaRu_mDMFg6-SX5w", "review_id": "W3JTf6ykdv9PPNYZ9SlOdw", "stars": 3, "date": "2011-05-22", "text": "Espresso: mediocre\n\nWi-fi: good\n\nOutlets: fair number\n\nSeating: good number of seats across multiple rooms\n\nCafe: hodge-podge furniture\n\nBaristi: not the most skilled\n\nNotes: breakfast tacos!", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o_naR5UiF1GJMDZ7Dkh_dw", "review_id": "mNkUaJJcL54ruPxjHRk6hw", "stars": 3, "date": "2009-09-07", "text": "winberie reminds me of john harvard's. pub food, heavy on the dark wood accents, hearty portions, decently-done. except for the fact that john harvard's has its own brews, and i don't seem to recal winberie's having the same.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DEXLNhl2iFcIRt7qECuyAg", "review_id": "nBKLF9zy5-PE3FLjQ4IVBQ", "stars": 4, "date": "2009-05-16", "text": "I'm glad there's a music store in town that sells \"indie\" albums for good prices.  I'm also glad that they usually play good music at non-deafening levels.\n\nBUT...\n\ncould the employees please work on their customer service skills?  Even a simple \"hello\" would be nice...or maybe a smile.", "type": "review", "business_id": "HPWmjuivv3xJ279qSVfNaQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0JTUKfQOugcSKDERwKnC_w", "review_id": "AB0BjNB0HMX0CWpR-MJNDg", "stars": 2, "date": "2011-12-04", "text": "I have never written a review in my life.  I'm not the type of person who just gets pissed at establishments and goes to write bad yelp reviews.  First timer.\n\nJP Java is a coffeehouse with some of the worst coffee I've ever tasted. (period)   I'm a barista myself and I am astonished every time I go to JP just how bad the coffee is.  I'm writing this review mostly so I never forget, and never go back to make the mistake I've made about 5 times now.\n\nTheir espresso is flat and their water for some god awful reason tastes of slight hints of mold.  Makes for a pretty shit americano (and somewhat overpriced on top of it).\n\nThis coffeehouse is right off UT's campus sucking up the business of a potential coffeehouse that would focus on quality instead of simply netting profit off students.  Truthfully, I expect a lot better.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y2JDfqEkbSdiInetOL2w5Q", "review_id": "xDz6Z0xxNfssi33smb8T9g", "stars": 2, "date": "2010-06-07", "text": "Good drinks, decent food, but the last time I went we saw a mouse in the dining area.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IF9jWNtiHUd_UbOGfwHtYw", "review_id": "J3YwJXur-TEfJAvXJ1LC7Q", "stars": 5, "date": "2011-10-05", "text": "Growing up in Princeton, Wimberie's was a staple for my family. The Sunday Brunches are awesome! Tons of different delicious options!\n\nThe food at Winberie's is great! The line to get a table is usually not too long and the staff is friendly.\n\nThe buffalo tenders tasty, the soups are delightful and the menu provides tons of options.\n\nThe only bad thing about Winberie's is that it is so far away now!", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wnvJig9i32WcOMsEVqgw9A", "review_id": "Jl3ZvkrmvP6V3UJE7yDfNg", "stars": 3, "date": "2011-05-31", "text": "This coffeehouse is a nice place to study near the UT campus. The prices on food are a little high but the clover coffee is good. The wifi is spotty, it is constantly going down.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "55czgsnxb0TBahmmeqO3jQ", "review_id": "mzFIFoJxhlMZ6dm7F98uuQ", "stars": 3, "date": "2011-09-02", "text": "Dependable pub food in a cool old bar, in a cool town. Worth visiting with the right expectations.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 4, "useful": 2, "cool": 0}, "user_id": "AG1ETqbneinRRJUeA8PfSA", "review_id": "2zGFWw7PdgYY69AoyAdrFw", "stars": 3, "date": "2007-01-14", "text": "Shh...don't make a big deal of this, but...well...someone once told me that JP's Java is a.....I shouldn't say it.....a \"Republican\" coffee house.\n\nI find this hilarious for many reasons. For one, I generally think of coffee shops as fairly progressive in nature, seeing as they primarily house academics, anarchists and starving artists. For two, aside from the generalizations, it seems strange to think of a place that serves coffee, tea and baked goods as a devoted member of any established political party. There are other reasons for my amusement, but I won't belabour the point.\n\nAside from the bad taste in my mouth from having said the R word (kidding, kidding), there are a couple things I really like about JP's Java. As Alexandra has already pointed out, the place has a good-sized deck out front that is ideal for people watching. Seriously...very cool spot for staring off into space whilst pretending to study. My friend Oliver (R.I.P.) used to do this once a week or so, and he looked entirely comfortable sitting there on the JP's deck (despite his ties to the women's movement). Secondly, I like their interior layout and their convenient location.\n\nThe drawbacks to JP's are 1) the occasional haunting quiet and 2) their lack of good desserts. There's also a strange vibe to the place that I can't pick up on...makes me a little uncomfortable....but I think that's me, not JP. Their coffee is okay, but not great.\n\nAnyway, might be worth a visit if you're near UT's campus.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dKA5pV924YpE3zmAzShLcw", "review_id": "vcGmsOp_6LG-8c-1Yb5R0A", "stars": 3, "date": "2012-05-12", "text": "Nice, big space, so two of us were seated immediately on a busy weekend in a spacious booth. Despite the size, the noise level was reasonable, and it was a comfortable, casual feel. The wait staff was attentive and capable. The bathroom was kind of a disaster - there was the garbage receptacle for paper towels, then a big extra garbage can next to it, and both were overflowing with paper towels. Is it so hard to put someone on bathroom duty every hour or so? I had a very tasty chicken sandwich - juicy chicken, good balance of each component of the sandwich. The fries were just okay. I'm disenchanted with all of the french fry choices I've sampled so far in Princeton. I'm not sure I'd choose this place for a fancier entrée, but for a sandwich dinner, it was just what I was looking for.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IE-xwQFolI5D9vs3hvoiZg", "review_id": "6WdKJJbK6EC5R8PKGWMsng", "stars": 5, "date": "2008-06-08", "text": "I usually go here when I want a good cup of coffee. I do like the coffee from the Seattle's Best on campus, but the Clover-dripped coffee they serve is worth the walking! I do not drink other coffee based drinks, but I heard their latte is pretty good, too. \n\nLove their warm and fuzzy ambiance. Not too big or noisy like Mozart's and not too tidy like Medici's (no offense! their coffee is also great. I buy beans there)\n \nThe restroom is kinda dark and hard to get into. Parking is usually painful on weekdays. Crowded in final weeks - hard to find a table w/ power outlet.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iWE4gOBIblCtEMOaq67Z7g", "review_id": "ed6vtMMaZY-sYXGFxa0c7Q", "stars": 5, "date": "2010-05-05", "text": "I need the familiar JP's sticker on my diploma and the words \"Brought to you by:\" in front. Simply put, I would not have survived engineering without JP's coffees and panini. \n\nI have stood outside their doors at 5:50 am waiting for them to open.\n\nMy usuals are the house coffee and mozzarella basil tomato panino. I used to get their Camper tea (lapsang souchong) before they ran out. \n\nThe house coffee is drip, but is quite strong to say the least. They also offer various award-wining grinds that they brew fresh with their Clover machine. This is a process somewhere between drip and espresso. While these other grinds can be expensive (tops around $7 for a cup), it's worth more than a glass of wine to me. Also, you can fill out your punch card with house coffees and use it to by a fancier cup.\n\nThey have quite a selection of loose leaf teas. Much better than many so-called tea houses.\n\nPanini here are the best, a friend of mine who lived in Paris for a summer told me that they had nothing close.\n\nWhen business is well, they are open 24 hrs/day during exam week.\n\nI am a little suspicious of the sudden appearance of beer and wine especially since there are two great pubs nearby (Posse and Crown).\nBut that doesn't really change my opinion of JPs.\n\nCons: The baked goods in the glass case are not at all worth it. Also, there is a seat near the entrance that is in some acoustic sweet spot. When the AC kicks on, there is a low-frequency rumble that drives me insane.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IaLqHbCIUJeDVRUsp-sjvg", "review_id": "xLsxI_IXQ8xBaoHXGs_nUQ", "stars": 3, "date": "2011-07-18", "text": "I love Winberie's!!! It's one of the most down-to-earth restaurants you will find in Princeton, and the artichoke dip with pita is absolutely amazing! The bistro burger is delicious (comes with brie and sauteed onions) - I get it every time I go there. I've also heard great things about the cajun mac and cheese. \n\nSo you are probably wondering why, if I am head-over-heels for Winberie's, that I would only give them a 3-star rating. I had an experience there where a waitress tipped herself on my credit card!!! The waitress we had was lousy (it was not a busy evening), so I gave her a standard 15% for her poor service. After we left, she decided that tip didn't quite cut it, so she tipped herself an extra two dollars! You have to be kidding me! I wish I could have gone back to complain, but sadly I wasn't close enough to the area to return. Learned my lesson and will only tip in cash from now on at Winberie's.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "AmWBYdyXJRxPKKW6HMhRrQ", "review_id": "NRZwZ5R4GbHBvGllDFcuIA", "stars": 4, "date": "2010-03-22", "text": "I saw someone order a glass of beer here at like noon. It was ridiculous and hilarious.\n\nThe coffee is freshly ground when you order it. The beans come at a premium price, but it's good coffee ($2-4 for 12 ounces depending on which bean you pick). The day I went, there was a band playing (which is irregular, from what I hear). Lots of people studying since it's right across the street from UT.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "0w-7pZtHcgGbdlBXupkiWA", "review_id": "APSlMPXE_Zgu81BPiYndnQ", "stars": 3, "date": "2008-10-17", "text": "I don't go to coffee houses for the coffee; I go there to paint people from life without getting caught.:)\n\nThat said, I was pleasantly surprised with the coffee.  Folks, I have been to every coffee house in town, and this was the best cappuccino - hands down.  \n\nHowever, the service, though efficient, was  blank-faced at best.  When a customer says hello to the barristra, even a smile back would be appreciated.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "u9GNxh2nCPKgO5Zhf23vaA", "review_id": "mLez6R9LXVCx7BTc2nYHEA", "stars": 5, "date": "2010-03-22", "text": "JPs is a rad joint.  The layout is great, especially the awesome patio.  And the coffee/tea is varied and of good quality.   And now they have an awesome selection of beers.   Some people like to have nice chats over coffee, and some like me wouldn't mind that chat over a good micro-brew.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9a0Pa7qSLT2EAVyITfBUew", "review_id": "1v_hR6eo_9vkY7uRs2WSCg", "stars": 2, "date": "2010-06-25", "text": "I think JP's interior is pretty nice for studying, it's spacious, most of it is well lit(not the back room), and there are outlets here and there. Barrista's are all quite nice.\n\nHowever some things are suspect, every single time I go here there are multiple flies buzzing around, it's really dusty in some areas, and the beverages and food aren't exactly great. I usually have to opt for a mexican coke because I can't stand their iced tea or coffee, and that's a shame when I'm at a cafe. JP's is nice because of it's proximity to campus, but... that's about it.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sje5nwf_MJVz6v2Q7B-Jzg", "review_id": "qnPd_-KwIMIxIsOaSCIjJg", "stars": 4, "date": "2012-08-22", "text": "My favorite watering hole in Princeton.  Winberie's is a great pub style bar, plenty of seating, extensive menu and great drink specials.  I only give it 4 stars as the food isn't top notch (lackluster as far as steaks, seafood and specials) but that's being a bit harsh really.  Easily my favorite burgers in Princeton, wait staff is awesome, they have cheap happy hour specials, wine Wednesdays and so forth.  If you get the chance, check out brunch on Sundays.\n\nI'd recommend this place more for the drinks then the eats.  If you need a quick burger, fried food or something along those lines- this is your place.  If you're going out with family or on a date, I'd steer clear.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dK2YRuRRlchR3Qe8c-bkSA", "review_id": "dsp5lJRZB7zIieNQEYw0Pw", "stars": 3, "date": "2012-02-26", "text": "I went here for the first time the other day with a friend.  He had talked up their special single cup coffee making machine and plus we were coming off an Asia Cafe food coma.\n\nThe barista appeared largely disinterested in helping us with our coffee choice.  My friend mentioned that he prefers acidic coffees-the barista recalled that they dont include that information on the cards they receive about the coffee.  Wonderful....\n\nI tried to order my first choice of coffee...out.  The barista gazed back at the board as if to provide some guidance only to confirm the fact that none of the other coffees were out.\n\nThe coffee was a little expensive but high quality and we enjoyed it.  They have a nice seating area outside.  Overall, not the greatest experience but has lots of potential.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Myap53reYBrsN8E9KqwupA", "review_id": "aHJG_xNTzbI1Iyb4EntW7g", "stars": 3, "date": "2009-08-29", "text": "The coffee here is really good. The Clover machine does something to coffee that no other maker has been able to achieve.\nNow if I could get rid of the constant student presence that sits at laptops for hours aimlessly pecking away at their laptops ignoring their surroundings and staying long after the last drop of their mugs has been emptied. It can cause the place to be antisocial and overcrowded. Not to mention the 6 or 7 token parking spaces that sit outside the door that are unlikely to choose your car to sit there.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LLJkjnNBXqx4bHtlHxeb5A", "review_id": "gIPJlEtqqvQKmi8pwT-mzw", "stars": 4, "date": "2011-10-16", "text": "The coffee is hit or miss sometimes, I agree with a lot of the reviewers. I find the hazelnut iced coffee to be sweet, but not too sweet, and the strawberry iced coffee to be unbearably NOT strawberry. More like coffee with not enough strawberry syrup poured in. Did I really pay extra for that? \n\nI asked one of the cashiers for her opinion on a smoothie once, and she said she never tried any of them. Thanks for your honestly, but I really did want an opinion.. I got the strawberry and blueberry smoothie anyways, and it was pretty delicious. \n\nFor a chill study environment though, this place is the best. They don't really care if you stay and linger, nor if you stay and chat for hours with a friend. There's a quiet room, but also other places with good music playing. Free internet, and they don't stop torrents! Also, dog friendly outside. :)", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mOh1Cpq1Z_xkPA8PcupObg", "review_id": "1a7RXZDTPR3RN5w4Sk8bTg", "stars": 5, "date": "2011-06-03", "text": "Every time I get back to Austin, I hit up JO's to get a cup of sidamo from the Clover machine.  Easily the best coffee in Austin.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B_294BHLjc922J2ujQdplQ", "review_id": "YInxmztR-i-00ZyFxjyoEQ", "stars": 3, "date": "2011-08-24", "text": "This is now called Berlin Tattoo. I've seen some amazing work come out of this shop. Especially, old school work. I've heard one of the artist is a real creep though, so watch out ladies.", "type": "review", "business_id": "lb9qELwduFgBo408x2VKOA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q6qbBT2o-OcLmpQJTFboDw", "review_id": "1wW2zjpYZZsVECxJjqlwtg", "stars": 1, "date": "2011-03-06", "text": "That was pretty messed up. \n\nWe just went into JP's, stood in line for like 15 minutes, the worker guy made a cup of coffee really slowly, gave it to a customer who had been waiting for a while for his coffee, then answered the ringing phone, spent like 15 minutes on the phone, not even telling us, \"I'll be right with you.\" Or have any kind of eye contact with us. We stood there for quite a while, he was pacing around talking on the phone. Even though he had a line of people, he didn't seem to care at all or want to serve us. No one else was working. totally messed up. I wish this wasn't the only place that was opened for students to study at this time of night. \n\nIt's your time, your money, your everything. This guy isn't doing his job. JP's needs to hire better people who care. And that don't act like zombies. \n\nDon't go here. They don't deserve your money.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J_M-GT7t8sWGcYyPKsTRVg", "review_id": "Jd626-i5kmsZPw96GUEZRQ", "stars": 2, "date": "2008-07-31", "text": "I had my first shiatsu massage here.  I didn't like it very much and didn't have that relaxation in my muscles afterward like I do with a Swedish massage.  It may be that I just don't like Shiatsu, though, and that the place does a good Shiatsu massage.", "type": "review", "business_id": "ae5tm46-ewAhUJ6HR4fXFA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jIiPMlQs-OaztONWFhFt5A", "review_id": "_TAPvmenJmTt0WYIlwArDg", "stars": 5, "date": "2012-10-15", "text": "They have wonderful coffee!!! The coffee art is really cool. I love the laid back atmosphere.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7KS9IjJYPgnNJI2OwXFJjA", "review_id": "2TmCiJIt9veDzdL8I6jDjg", "stars": 4, "date": "2012-04-16", "text": "This place is fantastic! A great alternative to driving all the way back to Western MA to see Andy. \n\nI was nervous for a few reasons:\n-new place\n-female therapist (worried she would not be strong enough to make my shoulder less like boulders)\n-my back hurt so badly I could barely move when I booked my appointment \n\nNerves were totally unnecessary. Liz, the therapist I saw, was SUPER strong and managed to get most of the tension out of my back/neck/shoulders (an impressive feat for anyone). The office was really easy to find (thanks to other yelpers for noting its proximity to BerryLine). And the price was so great! I mentioned yelp, and got $10 off. So it was $60 for a 60 minute massage. Something oh so hard to come by in Boston. \n\nThis is not the place to go if you want a frilly, Swedish massage with lots of oils! As others have stated, this is shiatsu, you keep your clothes on and there is no oils used. It's pretty much paying someone to kick the crap out of the knots and tenseness in your muscles and it is awesome!", "type": "review", "business_id": "ae5tm46-ewAhUJ6HR4fXFA"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "BDyCY898xb7QexX-XJgrEw", "review_id": "OK7_8WIRdzE0eMcECuPtCA", "stars": 1, "date": "2010-01-23", "text": "Even after I convince myself to go here and I go here, I can't convince myself to stay.\n\nIt is almost always a disgusting line (15+ people) due to this being a University coffee shop. People are either there right after class, or they think that no one will be there between class- along with everyone else.\n\nThere are a lot of tables along  the side of the building, but they're awkward for being social and often overwhelmed by people. Impossible to be a relaxing, coffee atmosphere.\n\nThere are two other cafes on campus, and this one is of course the most expensive. And while the baristas are all nice, because they're students and it sucks just as much for them as you, the business itself is dick. Privately owned, they NEVER participate in promotions, not for any cause. They don't even comply with the Frequent Starbucks Card system.\n\nI lie- they stock the AIDS coffee for sale. \n\nIt's not worth the wait for things this expensive, this bad for you. Go to main building, ThirtyOne41, and get affordable coffee/tea/muffins. I'm not spending  $3.25 for the exact same Tazo tea (actually, they only give you one bag for  a large at starbucks, but two in the main) that costs $1.84 a block away, with a nicer atmosphere and no line. No, thank you.", "type": "review", "business_id": "-ilTnXu41RrxQITuolQhmQ"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "RoWVC_rLZ85fFJrw6G8urg", "review_id": "o0JyEwNvi-ZSalNiMJC-8A", "stars": 4, "date": "2008-09-17", "text": "They mix solid drinks and make some tasty appetizers. I've actually never eaten much here (the salads are good, though!), but the atmosphere is wonderfully dark. This was my fiance's and my favourite haunt when I was still living in Lawrenceville.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "8EREGfplbS2s2MkZtXe4cQ", "review_id": "F0g8Pr-cIkh7bKNCBufENA", "stars": 3, "date": "2008-09-30", "text": "Want to taste 11 thousand dollars of hype? Go to JP's Java and get a cup of clover coffee! More on that later.\n\nBeing a total espresso asshole (and really, if you don't drink it, what's wrong with you?), I was excited to learn the espresso used here is roasted by Zoka in Seattle. I was also excited to see a La Marcozza Swift to make up for the intensely uninterested barista's implied lack of skill. The problem shined through when the shot was overextracted, an \"Austin flavor\" at most coffee shops. 9 varieties of coffee ain't going to save that.\n\nAs for the Clover, like any tool, it's only as good as it's user. It's far too sensitive a machine to be left in the hand of starving college students. You could taste fleeting greatness for a moment, which means it merely tastes like a good cup of drip. Meh.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "VPZ6_LS5BwCJ9iiNvMeZUw", "review_id": "RP1BxWVTpIVVCtZ5W3COFQ", "stars": 1, "date": "2009-06-10", "text": "Consistently poor coffee, overpriced coffee, and baristas that range from careless to angry has led to axe JP's from my list of cafes in Austin. Too bad, because the location is prime - which probably explains 80-90% of why this establishment is still in business (the other 10% might be explained by the better than average salsa that goes with the breakfast tacos; kudos to the catering company who provides that).", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7xum1MWf77uibDaSoQyFkA", "review_id": "0Xw0PV78eslxtUkxn118vA", "stars": 3, "date": "2009-05-24", "text": "3.5 \nGood food, good beer, and friendly.  Been here twice.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "A3ezL0M4Irb-NqbezjPi5w", "review_id": "LThiEEHYLUoNy46fErX6mg", "stars": 4, "date": "2008-09-17", "text": "Well, I can't help that this place was perpetually on the way to class and has pretty good coffee.  I will admit that it's just like any other generic coffee shop, of which Austin has an obscene amount.  However, I'm a biased person who also happens to be a creature of habit.  Also, it's one of those places where at least somebody (albeit not everybody) knows your name.  And I like a friendly hello from a familiar face every now and then.  Despite all that there is to like, this place charges ridiculous prices for its paninis, which I consider to be a sandwich disguised by a fancy name.  Psh!  Otherwise, I like this place.  It's a good thing that they don't serve alcohol because I would have never gotten anything done.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_wRTBeEpjXvH6oSl2dMhLA", "review_id": "oaUgzH__kNJzBLVj-4HNYw", "stars": 3, "date": "2012-01-29", "text": "Okay place-honestly it's very middle of the road, one step above Friday's.  Everything I've ordered has been just okay-edible and fresh but nothing special and for many dishes not worth the money.  My linguine with clams and shrimp was good but was $23.  My chopped salad was okay.  Overall, it's much better for the bar scene-the place is always packed for happy hour and on Saturday nights.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "sg-X_8sd4H-iyuHFyZGHgQ", "review_id": "rcDY4ZsW_ablTOBS3usJOg", "stars": 2, "date": "2009-07-20", "text": "I went to Winberie's with a friend yesterday for their buffet brunch. I'm not sure how many , if any, restaurants in Princeton have a buffet brunch so I was anxious to check this one out. Unfortunately for me they changed to an ala carte menu and yesterday was the first Sunday. I was pretty disappointed but we were already settled in our seats and decided to stay. \n\nI ordered something called the Breakfast Skillet. Hot skillet is brought out to the table with eggs, peppers, onions, cheese (Heavy on the cheese), accompanied by flour tortillas. I asked them to throw some potatoes in there and they were happy to do so. I proceeded to douse it in hot sauce (Tabasco) and put small pieces into a flour tortilla and roll it up. Overall it wasn't inedible, but strictly average. It came with a \"spicy garlic sauce\" that the server forgot to bring until half way through the meal. The sauce was disgusting. Seriously I think they took jarred chopped garlic and mixed it with ketchup. \n\nMy friend had the Belgian waffle topped with ice cream and whipped cream. He seemed to like it. Coffee was okay, nothing to write home about. \n\nService was attentive and pleasant. \n\nThe buffet brunch will be back in the fall when Princeton students are back, so maybe I will go back then and check it out. I will not be back for the summer menu.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "SNURSQilbXoezzcg1m9zVA", "review_id": "9AhmCE-lx4HQxRok-KF28Q", "stars": 3, "date": "2011-10-17", "text": "Saturday evening soon after 5pm and a few restaurants are not yet open for dinner making gastronomic selections limited.  Winberie's at first appears to be a college bar, but it's menu challengs that impression and, of course, Princeton is not your typical college town.  The restaurant, at least at that time, is full of parents with young children seated at tables, with a healthy attendance at the bar.  Lively at 5pm, so let's go!\n\nFancy bar food is what I would call the menu.  It's got your Joe The Plumber favorites like steak, hamburger and some sort of pasta, but looking deeper you'll find details that remind you of the sophisticated Princetonian atmosphere: the steak is fancy, the pasta specifically regional and there's a fish or two.\n\nI imagine being a Princeton student and taking your family here, with draft beers to please seasonal microbrew Dad, a white wine spritzer for Mom, some Bud Light for post college Sister, a big body Napa Cabernet for the Uncle and a dry martini for the alcoholic Aunt.  Life's good. \n\nA child's menu is fun, crayons included, and the service is very helpful.  Clean bathrooms, too.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vQqyGt8CgI1iypgR3G8RWA", "review_id": "w6XM7aLGdmjtPlo_LrmJYw", "stars": 4, "date": "2010-12-04", "text": "Good food, relaxed atmosphere, I definitely recommend.  The appetizers are great- I suggest the pitas with artichoke dip or the Sam Adams beer and cheese fondue!  Sandwiches and soups are really good also the Vegetarian Chili is excellent!  It can be busy sometimes but since it is pretty big I usually don't have to wait which is good :-)", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fD1xG9EDq9IvWc0_u4ggFg", "review_id": "4Mzu-7drc2l1fi9sRN7GNg", "stars": 2, "date": "2011-12-30", "text": "This place is probably better for drinks and appetizers, but I was in the area meeting up with an old friend, so we chose Winberie's.  The salad was totally average.  The company was fantastic.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xAzhXanKIkDA02xip6xRKw", "review_id": "YTYWt08NOCa7Uwlu_zQmEA", "stars": 3, "date": "2010-11-30", "text": "The best parts about this place is the location and atmosphere. \nI think its a pretty nice bar to hang out in, and meetup with people.\nReally only have gotten bar food here, but it was good... \nThe service is good, and the bartenders are very attentive.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-x0LnzxW1e3jhdzitPWM5w", "review_id": "TuWo8kYl9z_UDzHgSEbpBA", "stars": 3, "date": "2008-05-29", "text": "Winberie's is in an awesome location and has pretty good food.  I have lots of nice memories involving this place.  However, due to the lackluster bar scene in Princeton, going to this place now feels kinda like going to a high school reunion.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "a6EhIkvlAnZeGyBCZ_7OmQ", "review_id": "HpXFPIjgVUlvHjy3ZOT7vg", "stars": 3, "date": "2009-12-21", "text": "We went there for brunch on Sunday and they were friendly enough to accomodate a party of 9. We started off with some mozerella sticks and grilled chicken quesadilla; both were pretty decent. For entrees, we ordered bistro burger, char-grilled tilapia, cedar planked salmon, and mediterranean pasta. I don't know about the rest, but my bf and I had the tilapia and salmon; both were just okay. Nothing amazing about the food, but I guess it would be a great place to hang out at night with a full bar in the front  and plenty of seating inside. Also, if you parked at any one of the two parking lots nearby, ask the restaurant for a validated ticket, which is equivalent to a free parking pass for your car.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3BrP0927h_vleU_3UAQ_Lw", "review_id": "6FlJ55kyVPBktcmNQ0pxYw", "stars": 5, "date": "2010-09-06", "text": "I love JP's Java. Its espresso is the best in Austin, and its patio is the perfect location for fall and spring studying. I'm in love with their caramel lattes and mochas. They have a clean flavor that is mildly sweet - not overwhelming like many coffee shops. I also like that the shop is broken up into three distinct interior areas as well as an outside patio, so that if you're studying, you can generally find at least one area that is quiet enough for you to focus. The only drawback is their policy on charging an extra fee for using a credit/debit card (http://usa.visa.com/personal/using_visa/checkout_fees/index.html). I have managed to overlook this flaw due to their amazing coffee.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0FCZaeAh6Gc85iSWFXOm3g", "review_id": "w42VkhEXeovGoWYCN4Arzw", "stars": 4, "date": "2009-11-15", "text": "I'm writing this review based solely on Friday Happy Hour. This is the place that my group of friends goes to to get 1/2-priced appetizers and $2 drafts of Coors or Miller. The appetizers aren't outstanding, but it's nice to be able to go out with friends for $11 with a meal, two beers, and a tip. \n\nIt's pretty crowded, so you have to grab the waiter to order. The staff is pretty nice in that they let us move the chairs around since we usually have 10-12 people show for Happy Hour.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1s1J_yyl4Auhf2oi6ge5Iw", "review_id": "S6Ii0QqbWM0oea0B0Sv0hA", "stars": 4, "date": "2010-02-21", "text": "I am so glad our neighbourhood has JP's Java.  The guys behind the counter are efficient and polite.  They make fantastic dark roast drip coffee to order.  It is always piping hot.  That is my coffee of choice there.  Sometimes I also have one of the amazing cinnamon rolls (which must be made with a pound of butter each!)  \n\nUsually will meet a friend there to visit and catch up.... so yes, we definitely belong to the talkative crowd that the more studious tend to complain about.  But all said and done, it is a coffeehouse, not a library.  \n\nKeep up the good work, JP.  I hope you stay in the neighbourhood for a long time.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YOIorhfo8hHhilRyam2c4w", "review_id": "0wF90JLYC8ygzCpL-zBMTw", "stars": 3, "date": "2012-02-21", "text": "Let's start out with an important fact , for  all its affluence and \"sophistication\", Princeton has always been a lousy eating town.I don't really know why.New Brunswick and Somerville topped  it years ago.So your choices are surprisingly limited.You could do a lot worse then Winberies.\n\nI used to go fairly often but it had been about a decade since I'd been there.I was pleasantly surprised.The beer list ,while overpriced, is very good- Palm, Southern Tier,Sierra Nevada specialties, Founders  and more.I had  a good chicken sandwich( which is all you want at times. Occasionally I'm still chastised for having a chicken sandwich in Rio when I could have had piranha but look it's just a white fish - probably like tilapia).My cohorts had lobster clubs and turkey clubs.The fries were pretty good.Service was friendly and fairly efficient.I was happy(imagine Sisyphus happy) .That is a solid recommendation!", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "yNgQMxwdkU1RHu0kqQuCzA", "review_id": "DVt-urU16vAG58673gWy0w", "stars": 3, "date": "2007-01-15", "text": "Went there on rainy Sunday. I had a cup of Americano which was OK, but their roasting is too dark in my opinion. Oren had his double espresso which he couldn't finish. \nThe lighting inside isn't that great, so if you come to sit with your laptop and work there, it isn't the best place to pick.\n\nI wouldn't go back.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-OjFJxfWPpZgVEN6yHVq8w", "review_id": "LAT8glm2E2U7jd9Ekf6kfg", "stars": 5, "date": "2012-06-21", "text": "Fantastic burgers, and the cajun mac 'n' cheese is also really good.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PJbQOPzAhl5oBOSpAoxtmw", "review_id": "y75xjFZE4DQ-VPo-dw_Gvw", "stars": 1, "date": "2010-06-23", "text": "I like coffee, I like Starbucks in general.  I do not like coffee grounds in my coffee.   Just took a sip of my coffee and got a mouthful of coffee grounds.   Yuck.  This happens too often at this location.  \n\nDo yourself a favor and visit one of the 2 other starbucks on 34th st.", "type": "review", "business_id": "-ilTnXu41RrxQITuolQhmQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QF0urZa-0bxga17ZeY-9lw", "review_id": "eScs0uelr0kHJXJ7Tvzq2w", "stars": 4, "date": "2007-01-31", "text": "Great selection of posters and the prices on the cds aren't that bad either.", "type": "review", "business_id": "HPWmjuivv3xJ279qSVfNaQ"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "hE-hiLSWdWG1uOPElya0cw", "review_id": "b5BKCKx3cHHz7EvCEo8-2Q", "stars": 4, "date": "2008-07-08", "text": "It's a crime what some other coffee joints have done to the word \"coffee\", making it the equivalent of hot, burnt, brown acid-water. And don't get me started on what \"latte\" has come to mean--weak, milky water that dosn't even taste of beans.\n\nThankfully, there are some baristas who still know how to make coffee, and even more thankfully, there are still coffee joints that care about good beans. JP's Java has both. The coffee tastes like coffee. If you don't like coffee, please, continue to swill your Starbucks and have a nice day.\n\nI'll brave a trip over to JP's even though I can't stand being near campus. That's the one thing I don't love about JPs--the location. But during the summer when the students are largely gone, and especially during summer weekend mornings when students are gone, sleeping, and recovering from hangovers, this place is really special. I sit out back with a cup of not-too-hot latte and marvel that somewhere in this mainstream-coffee-loving America that are still a handful of places that don't water down their coffee to please the masses.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9vXRim_pJcX1XUQ9tmkQ9Q", "review_id": "itNKUJR3MAr8mrU7nAig2Q", "stars": 3, "date": "2010-07-01", "text": "JP's Java has great location, next to the UT campus, which makes them quite popular with the laptop set.  While the interior would be something special in most towns across America, it is sub-par or at least at par for Austin cafes.  Unfortunately, they take too much advantage of their location and get away with serving low grade coffee and uninspired breakfast tacos.  If you are looking for a better cup of Joe, it is worth walking onto the UT campus a couple blocks to score a cup of Texas coffee traders from Ohm's.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "U-DhIbadXOHDr_vEGe0efw", "review_id": "hBVs5h1Jq7wj70AYRxBa2Q", "stars": 5, "date": "2009-03-28", "text": "I have to say, I'm kind of baffled by the negative review of this place. It's the equivalent of rating Fenway 2 stars because you don't like baseball..... or rating the Boston Common 1 star because you don't like trees! \nIn an ideal, less polarized, world I'd give this place 4.5 stars. \nI've been going once a month since last December and I'm noticing that each time I'm able to become more relaxed than the last. That's a good thing! \nLiz is my therapist. She's soft-spoken. But don't let that fool you because she has Ninja fingers! In 60 minutes, she bends and folds, twists and pulls at my comatose body. Shiatsu kind of feels like someone is putting me in yoga poses while simultaneously working my pressure points. The result, for me, is leaving \"the shop\" feeling loose and better aligned. \nMy BF has also had Shiatsu here (by Liz and also her partner, Roger) and he enjoys it. He says he feels energized afterwards (2 reviews in one! - yelp, you owe me). \n\nI think the results are subtle and cumulative. Also, it's really nice to have this to look forward to at the beginning of every month. \n\nHere are the other details: \n- There are no oils, balms, or other baby-scented salves applied. So, the pressure can be intense at times. Which is why I keep coming back! \n- The space is small. It's located in what is mostly an office building, so during the week, you hear people walking the halls, and opening/closing doors (reason for the virtual 4.5 star review) I prefer NOT to hear the clamor, so I go on Saturdays. That seems to have been an effective choice. \n- You wear loose clothing, which is nice for those who prefer not to let it all hang out. \n- Parking can be really easy....sometimes. It IS in Cambridge after all. \n- It's remarkably affordable! Seriously, check out the website. \n- Oh, and the damn place is across the street (less than 25 ft) from Berry Line! Tell me that's not the jam.", "type": "review", "business_id": "ae5tm46-ewAhUJ6HR4fXFA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hSIZxolwa6prf-25Du0fIw", "review_id": "6tZPvSpasMbo7V4DFSveBg", "stars": 3, "date": "2011-09-07", "text": "I was very surprised with the variety on the menu.  The food was pretty average.   The night we were there, which I think was a Monday, there was a great burger-beer deal.  It was a little dark inside.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H3MRgiKXcccSGlGoejcxxQ", "review_id": "XReZdnD_QGxy_XTou2FkWg", "stars": 4, "date": "2010-10-03", "text": "If you like coffee, then you should like this place. Espresso ranges from OK to good, which is much better than consistently bad. They changed their blend a while back and, obviously, some baristas pull better shots than others. However, now Medici and Houndstooth have significantly better espresso.  Clover coffee is a bit expensive and honestly I prefer french press or pour over, but the beans they have available are really top notch. And they have beer.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DTMqqEV0BIwVYIhUxThbcg", "review_id": "DQ0hxwoMHz1plnQM5Mv2pw", "stars": 4, "date": "2008-03-22", "text": "This place is old school, as the TU says it's known as \"the Cheers of Cohoes\".  It's one of my dad's hang outs so I've been here a couple of times with him, but it's not only old timers a good younger crowd too.  I couldn't believe the $1 drafts (only Coors Light or Bud but still), which depending on how you look at it could be good or bad - good if you live close by and want to relive the college years or bad if you got a drive and no DD.  The food is decent and cheap.", "type": "review", "business_id": "A_Fm4v2-gQuGBBI-GBx4Uw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "cjp4s2vYqvbtqawlAaVcLA", "review_id": "AVNsKNWQY69ostZH4pwr0w", "stars": 5, "date": "2012-06-19", "text": "Very helpful, and knowledgeable. Very nice mix of workers. Great day shift weekend crew.", "type": "review", "business_id": "L5ABFgTmN-T-uZjuGpoi3Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GKkkdCphRDRmuaX5BaC_-w", "review_id": "Hnou84PUk2ULwmJTzfABHw", "stars": 3, "date": "2010-04-17", "text": "Man, it kills me to do this because I've been holding my office hours at JP's for three years and I love the community. The guys who work the counter are great, coffee is solid if a bit overpriced, and there tends to be available seating, BUT it is absolute bullshit how bad the wireless internet is. The connection drops with such frequency that it makes it impossible to conduct any professional business. I want to stay, but at this point I may have to relocate based solely on reliability, which would be an absolute shame because ....damn, what an easy fix. I'm toeing the line. I may have to give you up JP's.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 2, "useful": 0, "cool": 2}, "user_id": "7qjuo3CHzrCYURqDjHCL9g", "review_id": "wlYSobTVdvuqbQCkAaMFYQ", "stars": 3, "date": "2008-07-06", "text": "This place gets a plus for being close to campus, and the espresso drinks are very good.  Most of the baristas know the proper way to make the drinks, though at local Austin places, that should be the norm (contrast Starbucks).  \n\nJP's also has a wide selection of loose-leaf teas.  The brewed coffee--even this (pause for appropriate level of awe) Clover stuff--isn't great.  Most of the seating is not very comfortable for long-term use--unfortunate in a place close to campus where a lot of people study--and I wish it had more electrical outlets.  Parking can also be a problem during busy times, especially during the week, when street parking is limited by a residential restriction in the area.  Also, they theoretically have one of those discriminatory credit card policies that I LOATHE, though it hasn't been enforced against me for over a year.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ouODopBKF3AqfCkuQEnrDg", "review_id": "1itpUF7skIb7US-X6codfw", "stars": 3, "date": "2010-09-05", "text": "A fun, friendly bar right across the street from campus with decent burgers, great Wed wine nights, and inexpensive happy hour specials.  The food isn't amazing but it is good for the area and the service is usually decent, if it isn't overy crowded (which it will get on weekends).  Definitely worth stopping by if you're in Princeton and want a diverse selection of drinks accompanied by good food, of either the lounge or sit-down type.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TdANE88PQCEGeTtdsesb2w", "review_id": "i1gpFrZXzDrkqp8ZrOtOFQ", "stars": 5, "date": "2012-10-04", "text": "Awesome doctor! I was a little leery of going to a clinic that was selected by my company when I was injured at work, but I was pleasantly surprised that the friendly and efficient staff took care of me with no hassles at all. Dr. Tang had a warm and compassionate manner, and took the time to explain everything to me in detail. I wish she could be my regular doctor!", "type": "review", "business_id": "Iu-oeVzv8ZgP18NIB0UMqg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1tRhFdJgkcVtLg2lpMlN_Q", "review_id": "L-daudpuwyuYh-lR8nk-LA", "stars": 4, "date": "2012-06-02", "text": "This place is great for dining in. \n\nI love their pizza, well-done, with meatballs. It reminds me of living in NYC.\n\nTheir Utica Greens dish is really fantastic. Their sausage-based stuffed mushrooms are old-school fantastic. \n\nRegarding service, expect the owner/chef to visit your table to make sure that you like your meal. He's a young, energetic guy who really seems to care about what's put in front of you.\n\nMy only wish here is for a larger wine list. But, that's not a complaint, simply a request for a really nice spot in Cohoes.", "type": "review", "business_id": "A_Fm4v2-gQuGBBI-GBx4Uw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EBF0n1alKKytvvx7syZ-uQ", "review_id": "IziQov5ZxAnflQSK1jA5WA", "stars": 2, "date": "2011-08-31", "text": "Went here because Starbucks was only open till 10pm, but might as well have not made the trip.\n\n-Overpriced\n-Coffee not great\n-Wifi unbearably slow, with intermittent connectivity\n-Music sucked\n-Stuffy atmosphere\n\nI'll stick to Starbucks.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aU5dJ5KhcP8iHBZGi3CzuQ", "review_id": "_Xrit6lhi8HrdomHyndkxg", "stars": 4, "date": "2012-09-12", "text": "Nice pub style restaurant, and probs one of the more reasonably priced restaurants in the area. The food is hit or miss, but the spinach dip was usually a safe bet. They have good happy hour specials as well. As a side note, this was Brooke Shields's favorite restaurant when she was an undergrad, and my friend and I saw her our Commencement weekend chillin' with the locals and signing autographs.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TDsxf1U-orP85pO3iMBWyA", "review_id": "ySrOUAlR5BnJKxyzW4-Odg", "stars": 4, "date": "2011-12-08", "text": "Just your average Starbucks.", "type": "review", "business_id": "-ilTnXu41RrxQITuolQhmQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k8o5219XNyon2bBD-dXG2w", "review_id": "02-vMtg8oQxJAEz4gg32Nw", "stars": 5, "date": "2010-05-06", "text": "I can understand some of the criticisms of JP's that others have posted, however, they have some of the best coffee in Austin.  Everyone on their staff knows how to make a good cup.  You can sit down and stay for hours. They have pretty good baked goods, and the sandwiches i've tried have been of high quality.  Actually, i'd say quality is the name of the game at JPs, and that's a rare thing to find close to the UT campus.  The location is great and at least one of the employees on every shift tends to be really personable, if you feel like one of the baristas was short to you, talk to one of the other ones.  JP's is always well staffed, not like Bennu or Epoch which always seem to be understaffed.  JP's is exceptional with the exception of the internet, which can be really spotty.  Don't ever rely on it.  Come to JPs to read, write or just enjoy a fantastic mocha or cappachino.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "gV9Y1fHKqnMRExRErIvFag", "review_id": "7OjyZGbKMCST2iBuOoC43A", "stars": 5, "date": "2010-02-23", "text": "The Faith & Glory Collective are a small group of tattoo artists that banded together to form their own shop after years and years of working for larger, well known companies. The idea, as it was explained to me is simple, \"Do what you love.\"\n\nThe shop is in downtown Kitchener just above a 20/20 Optical which sounds like an odd place but the space is perfect. There isn't a lot of walk in traffic but you can always show up without an appointment and if they're busy they'll book you in right there. Calling ahead is always your best option as these gentlemen can have a waiting list. \n\nThere are four artists (plus an apprentice)  that call this place home and each one has his own style. Just taking a look around the shop is a good indication of how well rounded they are as the walls are covered in sketches and drawings all done by the shop artists. Sometimes they have prints for sale of these pieces.\n\nThe shop itself is open, well lit and clean as a whistle. Everything is sterilized and packaged properly. Counters and work stations are constantly wiped down, cleaned and cleaned again. There is a relaxed and comfortable atmosphere that seems inviting and positive. I think it's just a natural side effect of enjoying your work.\n\nThere isn't much in the way of parking so you might have to hunt for a spot at a parking lot close by (a block or so away at best, two or three at worst).", "type": "review", "business_id": "lb9qELwduFgBo408x2VKOA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aenRRdScxRH4etTadetOMA", "review_id": "Bx7MZobP9IiZY2vnvZ_iRg", "stars": 4, "date": "2011-08-31", "text": "Ok, so I am a graduate student, and I live south, so I don't typically frequent places on or near campus.  But this place is right by one of my morning classes in the ETC.  I've only been here twice, both times for a B-Taco and a coffee to go.  The tacos, provided by Elsi's Restaurant, are fabulous!  I had the black bean, egg, & cheese.  Perfect size, moist, and delicious.  The salsa is equally as good!  The coffee is great, always really hot (the way I like it) but never burned tasting, granted both times I've visited were in the morning. The service is good, the staff, although not exactly cheerful (nor am I at 8am) is friendly.  I personally don't want to interact with a Disney character first thing in the morning, so their solemness is actually nice.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GpR6-MnjMCxAINKy47rzyA", "review_id": "rN8f9Aw9pK1VXVbNCUEc1w", "stars": 4, "date": "2012-06-07", "text": "Went here for a group luncheon.  Good burgers.  Cajun Mac & Cheese went over well with those who ordered it.  Cheese fries, appetizers, and regular fries were good.  Salad was even well received.  Would definitely go to again.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zxtZqGUAlyi5MvsxKrDzVQ", "review_id": "qtTDPfatqVNvkQdrU6cAWA", "stars": 4, "date": "2011-08-09", "text": "Come here for the atmosphere. It's everything you want in a coffeehouse - except for good coffee. I'm drinking a JP's House drip cup right now and it tastes like sweat, which is generally bad. Chalk it up to the lack of a water filter, which tends to plague the Austin unawares.\n\nMaybe I should have sprung for the $5.50 cup...no...$2.25 for the perspiration special, please. On top of that I'm not feeling any kind of caffeine buzz.\n\nPrices for beer are decent and oddly specific (all of them end in .90, .60, or .65).\n\nThe teas and food are nice. The music selection is spot-on. The patio is great. But goddamn, the water....", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Z8uPefqzIjH_pg6o4lGFQ", "review_id": "n0-pTJJtfA2ecCghGASitw", "stars": 4, "date": "2012-10-03", "text": "We had a great time at Winberie's for our business group.  Our server was very friendly with good recommendations for appetizers, and which craft beers were yummy.  Loved the warm brie so much we got a second helping.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VJZPJjgZpO7Slo3_zWtsAg", "review_id": "87U6Ef5cQTjU2bq1I1cRsw", "stars": 5, "date": "2010-12-02", "text": "I will always love this place -- boyfriend and I had out first date here way back in 1997. The food is always good, and a nice comfy atmosphere (yes i know, not really a romantic first date place, but hey, we were 17, what did we know??)\n\nplus, many of my hometown friends and even my brother has worked here over the years :)", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MscSHzC119iiDRF1KggwPg", "review_id": "MYtSUSSkvIzHwVaDafyarw", "stars": 4, "date": "2008-06-30", "text": "Clover-dripped pressed coffee is equal parts \"wow that's good\" and \"do I really need my coffee this fancy?\"\n\nIt isn't as convenient as Seattle's Best for a quick campus cup, but it also doesn't taste like re-used coffee grounds dipped in turpentine, so it has that going for it.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oIorTSlDXx68CrugO2aRCg", "review_id": "Y0t7mrxhCNUcVESMgazpsw", "stars": 5, "date": "2011-03-02", "text": "I go here every morning and the mochas are fantastic! They make the chocolate for them in the shop themselves!", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PTtw3cOMoB_XN-ZtxXc4RA", "review_id": "42_B_7tCmoFZPg6hnD1PAg", "stars": 4, "date": "2009-05-13", "text": "JP's appears to be above all a study space for students from the nearby engineering and physics-math-astronomy departments, as well as the law school. One sits amid a sea of backlit inlaid white Apples, each casting its smart glow from its aluminum or plastic setting.\n\nThe place is great for lingering and studying. But more so than other coffee shops coopted for the purposes of preparing for finals, JP's allows the work to get a little too serious: enough that one is uncomfortable sitting down inside if all one wants to do is chat with a friend.\n\nNevertheless, the coffee is great, the patio is pleasant, it's close to home (RLM!) and I've completed so many term papers here. I'm glad to have it.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "phMJToNw7FWLX9oKzoAsYg", "review_id": "5y1eKe8r2WEiuh7mThZ0xg", "stars": 4, "date": "2011-12-08", "text": "I've been visiting JP's at least twice weekly for the last 5 years... This place has had a very large hand in my graduation from UT Austin.  \n\nThis adorable, hole-in-the-wall, yet trendy (but in a not-so-hipster way) coffee joint has the best study atmosphere anywhere near campus.  It's barista's choice for music selection here, but luckily JP seems to make good music taste an employee requirement.  You usually get hit with a wave of mellow hip hop-esque beats when you walk into the comfy grey and brown interior and walk up to the only clover coffee machines in Texas.  \n\nJP's installed a small bar with tap beer (and wine coolers..) about a year and a half ago, and also put in a couple flat screens (medium sized, not sports bar size).  This has resulted in a bbq every UT football game day and a rather diverse clientele (or more diverse than it was before).  However, sans game times and happy hours, JP's is the same it always has been: mellow, warm, and usually crawling with grad students, TA's, professors (a surprising amount of my old UT prof's frequented this place a TON), and the occasional frat kids.  Everyone is friendly that works here, and the clients are all a chill bunch.  \n\nSo after all this raving, why not the full 5 star review?  Although JP's has great quality coffee, it's all extremely overpriced.  You end up paying for the drink AND the atmosphere, which I am totally willing to do, but the reasonably priced places are the ones I reserve 5 stars for.  \n\nJP's is still my favorite study spot on campus (it's only a block away, I still call it campus), and I will really miss it in the spring when I move from Austin.  Highly recommend this place for students who need a strong coffee and a study space - and if it's finals time, be prepared to wait for a table or else get here early in the day!", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_dAgm9X9Gv_TuIT38npLyg", "review_id": "_VmzyWeXNH5k0XVFpOMyBw", "stars": 3, "date": "2009-02-25", "text": "JP's is a nice coffee bar, the espresso and coffee are very good and the pastries are delicious. It's hard to find a table (especially on near an outlet) because it's so close to campus. They have a huge patio, which is very nice, even at night. I would give JP's 3.5 stars if I could.\n\nI can sympathize with Michelle G., I always have trouble with their WIFI. Luckily, I can just pick up the UT network as it is just across the street from the law library. Their Barista's have always been helpful to me, but I am low maintenance.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0HZ-Y3EyE96zmpc2n6k9Ow", "review_id": "EneRidw9-Ir7Z8Zr7pzGxA", "stars": 4, "date": "2012-09-22", "text": "I took some family to see Princeton and was looking for a place to have lunch, but everything on Nassau seemed so small and crowded.  Decided on Winberie's which also turned out not to be all that spacious, but otherwise had a nice pub atmosphere.  The burgers were really good.  Paid with a large bill and told our server we didn't need change.  On our way out the door, she made sure to catch up with us to thank us for coming in.  Nice to know the big tip was appreciated.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4q6sA312pvh_FiAD7wy5-A", "review_id": "9p71dUg8qjgfnH2Ww7jHgw", "stars": 3, "date": "2012-06-17", "text": "This place would be so much better if there was room to move. \nHas to be a better way to arrange the bar area ... back-end is vast and usually empty while the bar is crammed and loud.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "IlbqI2QmRgT-QnjAnv7Y_g", "review_id": "MDD-0t-QOx82tX6UgoRL0Q", "stars": 3, "date": "2011-01-16", "text": "Nice atmosphere, go for the bar. Food selection was good, beer selection needs improvement... more craft beers!!!\n\nGood to catch up with a friend, or if your into a laid-back date. \nGreat service, bartender was the nicest! Salads were diverse.. artichoke dip was yum.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qq8_wsGicIneUeA9XJYaWQ", "review_id": "986tuUTG60SRX_OxzyQuPw", "stars": 2, "date": "2012-06-09", "text": "This review is from 4/26/12 I just was lazy and didn't finish it until now. Had my first bloody mary here.... ewe. It was SO peppery I couldn't breathe. Our waitress is was not great...  she was super awkward and kinda dumb. Lol and didn't check on us at ALL. The food was decent but way over priced... not going back there.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9tIY0VO9W8bT-I2wQM9nWA", "review_id": "4rr3Dfhv3r2pryEZS6xKTw", "stars": 4, "date": "2012-07-22", "text": "Not sure why this place has so many negative reviews but I've been here twice and had a great experience. Last time I went to the gym and came here afterwards for a small meal. I ordered the honey mustard and bacon chicken sandwich which, to my surprise, was awesome! Chicken was nice a juicy (not dry unlike chicken I've had at many of the so-called nicer restaurants in the area) and the ciabatta was super fresh. Boyfie got the veggie burger which was actually incredibly tasty. I didn't get any beer (for the first time ever!) but they do have quite a nice selection of craft beers. Sure, it's not fast food prices at Winberie's but our server was awesome. Our food came super fast. And it was tasty. \n\nBottomline: in my opinion, one of the few establishments with food that is ACTUALLY good and doesnt tout itself as being sophisticated. Come here if you're okay with a simpler looking place with solid food.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "wCtf5_zG8EpWiBp_Oi7P0g", "review_id": "UE49BGTfkppjg4CMPhs2KA", "stars": 3, "date": "2009-04-09", "text": "Ya gotta love that one of the closest coffee shops to UT's campus isn't a starbucks!!! (granted, for those of you with stock in starbucks, I am an avid fan, just when i travel I like to find the local spots so don't worry ha)\n\nThe mascot here is an owl which I think is kind of fun but I would like to know the story behind choosing an owl in the first place ha, and they have your average cafe menu and then fruit cups and scones and pastries, you know the usual. They have free water out for people to help themselves to, which is a bonus, BUT Austin gets hot. And this place is not really air conditioned.....everyone just looked a little on the sweaty side, and their outdoor patio barely had any umbrellas that most of it was in the direct, hot, beating down on you sunlight which I think would be impossible to study in or even hold a conversation in....\n\nIf the weather is nice, then this place is perfect--lots of tables and chairs, pretty decent coffee and fast service, and they take credit card too. \n\nBUT if it is hot, you better get iced coffee to go, because it will melt away probably only a few second before you do!!", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BwC6JnnmWP50MS6UubOv6Q", "review_id": "Tmv9vJoiAGJ48S9Csu6nLg", "stars": 3, "date": "2008-09-21", "text": "9:45 on a Friday and we were having trouble finding a place to eat.  Initially, I wasn't going to drink because of my morning SCUBA lesson, but after searching aimlessly for half an hour, I gave up and we stopped here.\n\nPromptly seated and drink order taken (Chilean Maipo Valley red and Blue Moon on tap).  Before drinks were served, asked what we wanted to eat.  This must be a local thing, as we're used to having our drinks while perusing the menu.\n\nOrdered the steak sandwich and a half mediterranean salad.  The salad was enormous, with pitted kalamat olives, soft, grated feta, tomatoes, etc.  YUM\n\nSteak sandwich was good too.  Medium-rare is closer to rare here, but you never know until you go to a place a few times.  \n\nWe ordered an Australian Shiraz (too soft) and cabernet from the bold list; the cabernet was incredible.  \n\nI think the server expected us to order more food, but we didn't.  We did, however, enjoy ourselves immensely.  \n\nPleasant service, good atmosphere, reasonable prices.  We'll definitely be back.\n\nLate dinner: $48 + tip\n\nNote: we saw them setting up for a brunch buffet Sunday morning (10ish), but the doors were locked.  Bummer\n\n2nd visit, also late: they actually forgot that we had been seated, so it took awhile for the waitress to notice us.  She was very apologetic, and our food arrived quickly and cooked as perfectly as last time.\n\nHad the bistro burger and chef salad with a bottle of wine: $40\n\nWill definitely go back, as the food makes up for the wait", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "119ZDdr0y9mFR8L7oYFSvA", "review_id": "0G2chAzpxNhS4jc73QadJA", "stars": 2, "date": "2009-01-16", "text": "This is just your basic American food place with a bar. It's kind of like a TGI Fridays but more expensive. Covered in old skool Princeton memorabilia, unique forks (3 prongs... very medieval looking), decent service. The portions are large, but even still the prices are high for such basic, unremarkable food. The menu isn't very exciting or exhaustive. I've never gone there because I had a craving for it, I've gone because it's convenient, and slightly less expensive than the better restaurants around. I've never been there later in the night for the bar scene though.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oVU2xcHYC-Fj4gg_-HaUOA", "review_id": "lVyKZ8v_VP5EvEwh-BVKtA", "stars": 5, "date": "2010-09-23", "text": "I've been coming to JP's since 2003. The place has changed a lot since then with nice enhancements like a food menu and a mini-bar. It was and will always be my favorite coffee shop, especially in the summertime when there are far less students.\n\nThe coffee here is the best in town - house coffees as well as espresso creations. Try the Caramel Latte. The baristas were more friendly and made better coffee circa 2003-2006, but the new folks are almost just as good.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pLlRrcoDrzX7QSlTTcG0ow", "review_id": "Cw9-K8gzDj04muYdQvF0qQ", "stars": 5, "date": "2012-08-28", "text": "This is an excellent and convenient location just down the street from 24 hour fitness.  I can easily get my protein needs here after a strenuous workout, including the isopure ready to drink brand.", "type": "review", "business_id": "L5ABFgTmN-T-uZjuGpoi3Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-TdnnNdi7xAW-xR7lcEXXQ", "review_id": "njti_aHUiQ2xiQXd4JU1tA", "stars": 5, "date": "2012-01-03", "text": "Winberie's is my favorite restaurant in Princeton.  The hostesses, bartenders and wait staff are always provide friendly, courteous and fast service.  The food is GREAT. They use quality ingredients and they don't skimp on quality or portions.  They make my absolutely favorite burger.  I HIGHLY recommend this place.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "RUADiQkUCe-qI5C5_IlFOw", "review_id": "tQ1yeeO75DHOSn2cdb5ngg", "stars": 3, "date": "2009-05-07", "text": "Oh, JP's... If you didn't have so many nasty law school memories attached to you I'd probably like you more... Then again, some of those memories are nice - like the free coffee...\n\nSince this place is so close to campus, one would imagine that they would have reliable WiFi, large study tables and an abundance of outlets for laptops. But alas, it is not the case. \n\nThings I do like about JP's: they have decent coffee, yummy sammies and a great outdoor area (with big tables for studying). I spent many warm Texas evenings out on their patio, sipping an iced coffee and trying to pretend like I was reading a novel for fun instead of a casebook. Sigh...", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XQKDm_voMjyHHjfSQri_IA", "review_id": "4ZkMU8J6aMY3X48MJ0g3Pw", "stars": 4, "date": "2011-05-04", "text": "Comfy and Clover coffee. I like this place!", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-hKniZN2OdshWLHYuj21jQ", "review_id": "vEOjeNFSEJOJNRV_-IlmQg", "stars": 4, "date": "2007-11-20", "text": "I've gone here for lunch a few times.  There are some great big salads and other worthwhile pub-like food.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Lr3Nlbzp3b31KooZPvrrdQ", "review_id": "iM4qJEiOVboXM04oPlIaoQ", "stars": 3, "date": "2010-08-22", "text": "Their Wifi signal was good and steady.  They have a wide assortment of foods.  I got a Caprese pannini which came out with warm fillings but crispy bread or less crispy bread and cold fillings.  There are also some stretchy $9 pizzas which I'll get try next time I'm here.\n\nThere are lots of tables inside and lots of walls of windows.  On a Saturday night at the end of summer just before the Fall semester starts, there was a lone employee at the counter doing everything around the coffeeshop.\n\nThey have reduced hours during the summer, closing earlier.\n\nThe location is convenient to Engineering and Law students, being right behind ETC.  It is also near Posse East.  There were probably at most 10 parking spots in that tight parking lot.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A00hZsgc8RQzve2XkOhe8A", "review_id": "F-uXIn1iCWVzhza1qm4duw", "stars": 2, "date": "2011-02-10", "text": "The world could do pretty well with less j b winberie's. Totally un remarkable. I Don't mind a boring menu if the food is well prepared, this has plenty of the first adjective and not much of the second. \n\nTerrible beer selection, worse than your average ruby tuesday's/Fridays/et al. \n\nThe thing that this place has going for it is the furnace. It's warm while the Princeton area is effin freezing.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GyLhdmxoXHBjz3DFr_4CKw", "review_id": "tJItLPeWnL31ew6KqopRNQ", "stars": 2, "date": "2009-10-09", "text": "OK. Not great. Burgers are good. service so so. a small step above Fridays", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "OSbuXWZqW4iouNTKibaw6w", "review_id": "Is3DvyVevYRKAUif4MCMBA", "stars": 5, "date": "2009-03-02", "text": "Five of us ate at Winberie's last night after returning from a ski weekend in P.A.  I was craving a good salad, so my cousin suggested that we try Winberie's.  I ordered a cup of chili con queso and the Southern Fried Chicken salad.  Both the chili and the salad were delicious, but that chili was SO GOOD!  I'll definitely order that when I go back!  We all ordered dessert, and my friend and I shared the apple pie.  Now keep in mind, this wasn't just regular apple pie, it came with a scoop of super delicious vanilla ice cream, this amazing caramel sauce and pecans.  Ok, I want another slice right now!  Seriously though, everything was really good, and our waitress was both friendly and attentive.  I'll definitely go back!", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "XDnlriVXnZgFYXHqphBJ3g", "review_id": "OdtTHdb1kpUvZcqBHofzeA", "stars": 4, "date": "2008-02-28", "text": "I'm not a coffee drinker, but my husband is, big time.  He read an article about this coffee maker called a Clover.  The Clover is a super high-tech machine that controls the temperature and brewing time of regular drip coffee kind of like how an espresso machine does espresso.  The Clover machine is super pricey, and only makes itself available to coffee shops that sell the finest coffee around.  They choose their clients.\n\nJP's is the only place in Texas that has a Clover.  In the whole wide state!  That alone made us want to check out JP's.  One night when we both had a lot of stuff to do, we went to see about a Clover.  The Clover brewed coffee was hands down the best cup of drip my husband had ever tasted.  He is like a Clover fiend now.\n\nTheir freshly squeezed lemonade was excellent for my non-coffee likin' self.  The place was packed at 8pm on a Sunday night, so we ended up with the table way way way back on the patio, where the electrical socket didn't work and the table was cheap and a little dirty.  Wireless still came through like a champ though, and if you're a UT student, you can also connect to their network, too.  Both were in range.\n\nI mean, if they're busy, they're busy, but maybe they could upgrade those few tables in the back, or make sure to wipe them off with the rest.  My husband is crazy for their coffee now, though. CRAZY, I tell you!  He'd rate them six stars if they could.  I'm cutting a star for the unequal accommodations in the way back.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BibABXggCleZ4QNjiOjJkQ", "review_id": "b4arZXDHNh0dypzDvDyjnQ", "stars": 4, "date": "2011-05-10", "text": "I decided to drop by JP's Java after buying the $1 deal from Campus Cred (whoohoo!) It's located pretty much directly behind the ETC, which is a pretty convenient location to get to by bus from anywhere on campus.\n\nThe lighting is nice and it's pretty quiet, which makes it a decent study spot. The theme seems to be minimalistic hipster cowboy, with the worn leather couches, iron lone stars on the wall, and cowboy music playing in the background. The wifi is solid too, as long as you know that the security code is \"espresso\".\n\nI ordered a soy Texas Toddy, which is basically a vanilla iced coffee with soy. It's refreshing and light, not too sweet or too creamy. I just saw their pictures of latte art on Yelp though, so I might go back and try one next time.\n\nAll in all, it doesn't seem like much of a fun hangout, but it's a great study spot, especially since pretty much everyone inside seems to be studying too and just quiet conversations here and there. I'm hesitant to spread the word though, seems like a pretty nice hideaway to keep for myself and the quiet few who are already here! Will definitely revisit, and try some pastries too.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sfLRoz-80vVFhYKumHrPQg", "review_id": "OdUs2xUG3NuTcBeiB_Ntuw", "stars": 3, "date": "2009-09-06", "text": "Went to JP's Java when visiting my kids in Austin.   The coffee?  Great.  Really good.  The atmosphere?  We could find NO table to sit at to enjoy our brew.  It looked like a field of cows and their cowbirds...  one person to each table, each with their laptops open and each table with 3 to 5 chairs empty.  No conversation in the place, just dead.  Really a depressing atmosphere.  There has to be some way to improve this...  maybe do more 2 person tables?  Or require folks to double up or something?  Or would that simply mean more cows... and so more birds. As for us, we'll have to find another place for our business.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "aIXrSPFM0NREmpeM_3y-gQ", "review_id": "3AM1OkmMqmtUFF19rnw-3g", "stars": 4, "date": "2009-12-28", "text": "JP's Java, a well-known spot for quite a few Physics and Math majors who unfortunately spend their lives at RLM (that huge ugly tower on Dean Keaton and speedway), myself included.\n\nI come for the sandwiches and environment; it's usually filled with quiet, busy grad students, making for a great study spot.  It's really warm in there sometimes, so I usually don't get any hot drinks.  I'm not a coffee guru, but I do know that they have really pretty foam (I had a heart on my latte once) and excellent paninos (why they call it that instead of panini, I've no idea).\n\nPlus, they discount their day-old muffins.  mmmhmmm.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "JXbz8URET4T6SWVrDmKWTA", "review_id": "I6uIM52orRLwAlAqMMkDtQ", "stars": 3, "date": "2007-02-08", "text": "I used to frequent this place back in high school and college, but now I'm not as regular.  The food is just average and there's a lot of better options around town.  The service is always good, especially the bar service.  Very casual, wooden booths and tables throughout the place with black and white photos of past Princeton athletes and events lining the walls.  Weekends are very busy, especially the bar, so except a crowd and possibly a wait to be seated.  Mixed bar crowd - some older folk and lots of college students too.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "tK4rK-icLbgOSi7z5BWrnQ", "review_id": "NPzoVcumFYCJQt2eQh9PKg", "stars": 4, "date": "2008-10-07", "text": "Well I like getting frozen frappe style drinks at coffee shops - I got the Thai Tea thing they have and had it frappe style and it was really really good.  It tasted really sweet and yummy.  It was mixed really good to where you're able to drink the whole drink.  Some coffee places mix their frozen drinks and you're soon left with just frozen ice mush at the bottom - not this one.  It was Starbucks consistency.\n\nThe atmosphere is really good with plenty of indoor and outdoor seating.  More space than your typical shop.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 4, "useful": 5, "cool": 5}, "user_id": "XN7gmypk2antDlllPKFgxQ", "review_id": "2rU9V7vy8EGt7_tTfAywMA", "stars": 3, "date": "2008-09-09", "text": "Dinner at the Bar Review\n-------------------\nCame here after a coworker (a former Princeton-ite) and another coworker suggested this place as a place to catch AP on MNF.\n\nRollin Han-Solo-style, I sat at the bar... the pre-game show was on (with no sound)... and a Jammin' slow jam playing in the background. By Jammin' I mean completely inappropriate for MNF. No worries though, the bartender turned up the volume on one of the TVs so balance (but not hide) the jammin' slow jam in the background.\n\nOrdered the Mediterranean Pasta with Chicken. Muy Excellente I must say. Quite enjoyed the penne pasta with chicken, olive oil, capers, sun-dried tomatoes, and olives.\n\nWas kind of sad to hear after I was drinking my Guinness that they had a $3 Tall Coors Light special... I guess I had to be a local, or at least just smart enough to ask \"do you have any specials\" to find out what they're specials are.\n\nI enjoyed my time there... could see myself venturing here if I was a local...", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fj3lVmBpz9DF9pYVl9Xj7Q", "review_id": "Yuiy--FrYe9qZm3-rH6NPA", "stars": 5, "date": "2011-02-28", "text": "Clover coffee! Attentive, skilled baristas. Tasty sandwiches. Homey atmosphere. Beer on tap. Love this place.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yvgE0bKa3ikEnXiN3MLJDw", "review_id": "nSPj48ETT9H5ilSeDwAJSQ", "stars": 3, "date": "2012-04-24", "text": "I think that my rating might be closer to 2 and a half, but I'll get to that in a bit.\n\nThis is in the middle of Palmer Square, and I knew that it was likely to be a little \"meh.\" But they had a good happy hour and I just wanted to grab a light early dinner and go to bed early. \n\nIt has a nice pub feel to it--sort-of what you would expect from an Ivy League staple. The bar is pretty and classic feeling. It had a good crowd the night I was there. I got a inexpensive glass of wine and the happy hour special quesadilla, which was good. \n\nMy gripe? It smelled AWFUL in there. Just a really putrid stale beer/vomit smell that made you want to leave. I thought perhaps I'd get used to it, but it was really vile. The guy at the bar next to me asked me \"Is it just me or...?\" and I assured him that no, it was not. I guess most people didn't mind it as much, and I couldn't bring myself to ask the nice bartender \"what the hell IS that?\" \n\nI hope that was not typical of them, but I can't see myself making a beeline to go back there after that experience.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jF46UKNQjxEsJFTeSPoPag", "review_id": "CBJajcFjlhzCpCgEDcOW-w", "stars": 3, "date": "2011-06-07", "text": "Solid bar and Princeton institution.  Right off Palmer Square with a good selection of beers and pub grub.  A few televisions with the news and/or the game on, decent seating, and workable menu.  Not going to steal the thunder of Ferry House, Elements or Teresa's, but it's a good mainstay for a quick bite and pint.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cAb-WlrO_Yr7a2ld5UMUAg", "review_id": "3V-0DeGrQzskInXCn1gPvg", "stars": 4, "date": "2012-08-09", "text": "A lunch staple in Princeton, you can always find a good burger, sandwich, or salad on the menu.  Sometimes the specials are hit or miss.  Not bad for after work either - spacious enough bar to hang with some friends and have a drink.  It can get crowded at times, so you may have to wait for a table.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "qRg_8ByuH12bAd5Yjvxu0g", "review_id": "IQGGVH1FZlIRAfSfZDNVxA", "stars": 4, "date": "2011-10-08", "text": "(staying at friend's place in Austin): Hey, is there a coffee place we can walk to?\n\nSo, I was quite pleasantly surprised that this was nearby and the local coffee spot.\n\nGood outdoor patio. Enjoyed a number of iced coffees and lattes here while visiting Austin.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LXvn-Wl2Sjzvl_7TxK-x6g", "review_id": "1yNzvZkV-51fgmAVEwmskw", "stars": 3, "date": "2011-05-13", "text": "This place is pretty much a middle of the road, neighborhood favorite. It's a nice go-to if you really have no other choices or ideas on where to eat/drink (since princeton is lacking in the latter). The menu is american favorites and nothing extraordinary, but nothing particularly bad, the bar is ok- small and cramped though when crowded. \n\nOne time, me and my friends wanted to get drinks, and one of our group wanted to eat, so we were seated in the dining area. But, since three of us weren't eating, they kicked us out into the bar area, where my friend had to eat her bowl of chili, holding it while perched on a bar stool. It was pretty ridiculous, so it's deterred me from bringing a mix group of people, ie- people who have eaten and want a drink along with people who just want to drink- it's either or! \n\nThey have an excellent sunday brunch, however.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pNHnFm_YybxPrtwfbbs7HA", "review_id": "31zmHYE_O7eAE-_LNU8roA", "stars": 4, "date": "2009-07-14", "text": "I go to JP's Java often to study. I really like their coffee, and sometimes they put designs and swirls in the foam! Pretty cool. Great for studying if that's what you're into. They have two very comfortable couches. Other than that, the seating is pretty sad. Also, parking is a pain. \n\nI can't speak to the wi fi problems people have been talking about because I've never really had an issue with the wi fi. \n\nOverall, just your average, run of the mill student coffee house.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jonnt0r5l8Bp9dXq4fv-ow", "review_id": "v0cC76jrQfRG0PBv1Q0xZg", "stars": 4, "date": "2010-12-24", "text": "I have been going here since I was a kid and I love it! The food is great and the people are nice. Try the fondue.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BPQnqug6aYmfwynwSIjZFQ", "review_id": "A3exs9mqwOz60HN9j6JI2g", "stars": 3, "date": "2011-04-22", "text": "Not a bad place.  I've eaten here twice this week, mainly because it's open late enough to serve food until rehearsals end. \n\nThe food is good, but overpriced.  The Cajun Mac and Cheese is really quite good.  The wait staff is generally helpful, but the servers are reluctant to seat people unless the party is complete.   this is fine if the place is packed, but in neither case was is so. \n\nIf Princeton had a wider variety of later-night eats available I'd probably try to find something else, but this seems  to be about all that's available with the exception of Hoagie Haven after 10.00.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "5OivyZndZ9_rCbD9dVtERQ", "review_id": "uXQ0eyKkqbPVaQuuhic2Hw", "stars": 4, "date": "2007-11-03", "text": "Definitely a great place to stop in for a quick, but a little pricey, cup of coffee when you're cruising around UT or the drag.  Their lattes are quite tastey and are topped with some of that beautiful artisan foam.  They have a nice large deck which is perfect for these mild temperatures we are lucky to have right now.  The inside has plenty of seating and some nifty art work.  This isn't the best place to crash and read or study because it can get a little loud ... and smoky outside.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "lS8FHMmWEnpEl2IaIrCNnw", "review_id": "q39sg1FJfkG1k4tEGFbsRA", "stars": 4, "date": "2006-11-25", "text": "Another one of my favorite coffeehouses because the patio is on the front, and not hidden in the back, a la Europe.  \n\nThey open at 6 AM Monday through Thursday, so if you're a student, or even just working in the vicinity of campus, it's a good place to stop by before you have to be in class or at the office.  The parking is decent, too.\n\nIt's on the corner of San Jacinto and Duval, so there's much to watch go by.  Even if it's just the time.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "PdpWp_j67Nfr_oQF-4yKUw", "review_id": "KZylpVZjifX-v3FV_sVbmg", "stars": 5, "date": "2008-05-03", "text": "If I lived in Austin, I'd come here at least once a day.  The ambiance is wonderful.  The coffee is superb.  My double macchiato was simply delicious.  Wow!", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "V-XntDmY9bLdUcnEDwYMpA", "review_id": "lANgmjidVZ49t01DZGv1tA", "stars": 3, "date": "2010-04-03", "text": "Without the patio JP's would be just another pretentious coffee pusher (One caveat to the patio, bring headphones because as much as I love nature, a slew of Grackles chirping their ugly faces off can be a bit distracting). Yes, their Clover coffee is good, and it better be for $2.50. However, JP's identity seems to be a bit muddled...\n\nJP's, you're a coffee shop. There's no shame in that. Your ass-worn chairs and scattered approach to design are fine, because after all, you are a coffee shop. However, you seem to have lost sight of that and have gotten into the booze trade but you aren't a bar. Even though this offering may net you a few more dollars in sales, it's not the bulk of your business. Offering beer detracts from the contemplative sanctum that a coffee house should be especially in a town with more bars than people. Furthermore, your customer service is akin to stoners operating a lemonade stand. The Barista is supposed to serve me and make me feel welcome and yet I seem to be on His schedule. Stop talking to your friends...at least while I'm waiting to PAY for something. That's great that you're trying to make plans for your 'epic' weekend, but I'm sorry, I just don't give a sh*t.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tI6UME6YbdxB9Tv30iry8g", "review_id": "APkgzJxSX2-BWonEbEOEGQ", "stars": 3, "date": "2011-11-20", "text": "Went here to study. Nice atmosphere, quiet with funky, relaxing music, everybody's pretty much on their laptops studying. I like it. My only gripe is that I ordered a chai here and it was way expensive at almost $4 for a small considering that it was watery and didn't taste that good. Other than that though, I like the place.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "FZGQRklf78yNeF_NtWGfuA", "review_id": "mHvqjIc6tw2_WRiOchZH9w", "stars": 1, "date": "2011-06-20", "text": "I stopped here on the way into school on a saturday morning.  I got a machiato.  A machiato is really good, if the espresso shots are pulled properly.  Unfortunately, these were not.  I decided to watch the barista pull the espresso shots.  He tamped the espresso too hard for the grind.  This resulted in the water not being able to move through the espresso grounds fast enough.  Extended contact with the water results in a really bitter espresso shot.  I tried to sweeten it up, but there was no saving the flavor of this machiato.  However, i'm addicted to caffeine so I drank it anyway. \n\nIf you come here to study, stay away from the espresso.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eOz2IdGXU6NqU_wcaelkDQ", "review_id": "zVB3myIOIhipmSHUzv2cVQ", "stars": 3, "date": "2010-05-20", "text": "Been here a few times . The food here is actually pretty good. I was surprise. I've always walked by this place many times and ever gone in here. Is this a place that I have to visit? No. It is a place to get good food when you're hungry.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3K_E9m8mRtkYMloDeyjhfw", "review_id": "DdEEHmfFOGK8q6TX8oJkRw", "stars": 5, "date": "2008-12-18", "text": "I HIGHLY recommend Harvard Square Shiatsu!!!  I'm a tense & active person & this massage was just what I needed to RELAX and REVIVE. The environment is inviting and comfortable, and the masseuse is very skilled & caring. I went into a deep meditative state that refreshed my mind & body. You won't find a Swedish massage, because that is not their specialty,  but if you are looking for an AMAZING SHIATSU MASSAGE EXPERIENCE come here!", "type": "review", "business_id": "ae5tm46-ewAhUJ6HR4fXFA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GDibrLNAg3PeABaOfZ7PcA", "review_id": "vcryLSdT8vFM0ARL7xiQEQ", "stars": 4, "date": "2009-03-23", "text": "I don't know what these people are talking about when they say the baristas are rude because they have been nothing but sweet and accomodating to me. Polite, quick, and good espresso drinks.\n\nI like this place because it is close to the ECJ (my second home as a UT engineering student). So I can escape to JP's and do some work between classes while enjoying a cup of coffee outside or hidden in a corner inside. And on a nice day they open the garage door windows and the inside is just as pleasant as enjoying the outside and I don't have to worry about my notes flying away or the glare from the sun.\n\n\nThis is the best coffee shop near campus because it's not Starbuck's, the music is not obnoxious, they have a patio, and the coffee is yummy. Maybe I am not an expert but I like JP's and its people.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "wo-LvQxKQGV_s9ESqioQ-g", "review_id": "pT6iTQj66Foovo2HJkVLDg", "stars": 3, "date": "2010-05-04", "text": "Let me come right out and say that, as a blanket statement, I hate Princeton. Never have I encountered a town more impressed with itself. I had the misfortune to live there for 6 years and let me tell you, I'm still recovering.\nSo, read the following review bearing this in mind.\n\nWinberie's is a fine place to go if you want some tasty, pub-style food and don't mind slow service.  Most of the offerings are overpriced;; I don't think there's a burger on the menu that isn't $10 or more, and for no discernible reason. Sodas are almost $3! Sheesh. Bartenders are generally excellent, but be prepared for a VERY crowded bar during peak times and games. It can be extremely loud, too. Sit in the restaurant area if you want to hear yourself think.\nDecor is simple and homey- think Applebee's-style framed local items and art pieces showcasing local famous folks (Einstein, Peter Benchley, yadda yadda).\n\nParking in Princeton is always a problem, so if you don't live within walking distance expect to pay to use one of the nearby garages. Thankfully, the rates are reasonable.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7vN1c6P_EgPvBsx-IgJpvA", "review_id": "mwcWMikQaoyVIU_3QBqVFA", "stars": 5, "date": "2009-12-08", "text": "As an ME student, JPs java is the closest place I can go to get a good cup of coffee. But it is so much more than that... \n\nBreakfast - The tacos are amazing \nLunch - The ham and havarti sandwich with baby spinach and caramelized onion puts any other lunch options in a 300m radius to shame.  The roast beef with brie is also a great choice. Both are served on nice focaccia bread.\n\nAnd finally the coffee: I'm not a coffee snob like several people I've seen reviewing this place, but let's get real. It is good when compared to Starbucks, Texenza, Texas Traders or anything close to the engineering block. And since I practically live next door, with the punch card i get any coffee for free in a few days. The calle del copey is delicious!\n\nAs for the drawbacks,\n\nBeer - Hmmm... Beer? Drawback?? Maybe some people don't know how to enjoy a beer without getting drunk or something..\n \nI admit that seating can be scarce sometimes, but I've always found where to sit after a few minutes if not right away.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HGBHupu8mWzRGM0aeXaNcA", "review_id": "mnyBA2GUEn9CfZdFctNxlw", "stars": 3, "date": "2008-05-10", "text": "I came here a couple times for lunch and was pretty disappointed unless I was sitting at the bar.  The wait staff was basically non-existent so I would say if you want good service to sit at the bar.  \n\nI only came here once after hours and it was your typically college crowd but it seemed a bit \"stuffy\" for my tastes, so I typically ended up at the Ivy.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ll9cXJlbMxLKiKcJCHC1gw", "review_id": "3Qa298JSGReaHFXAdKHn3w", "stars": 2, "date": "2008-06-30", "text": "Not bad if you can find a seat that isn't taken by someone studying.  The coffee was ok, but not worth the hassle.  I don't understand the praise for their coffee.  Just because it's better than Starbucks, doesn't make it good.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 5, "useful": 12, "cool": 6}, "user_id": "YSfAlm6XNaym-JOrRjv3Tg", "review_id": "GQ8J98MdCqoM4STx3nqbjg", "stars": 4, "date": "2010-03-02", "text": "Yes, you read that right. I'm giving a high rating to a property management company. Hell hath frozen over.\n\nBut seriously, these guys are good. From my very quick move in schedule (I first viewed the apartment just a few days before I moved in, and they managed to clean and touch up the paint that quickly) to the ease of moveout, I really appreciated the hard work of Jenn and Charley and the rest of the folks here. \n\nWhen I moved in the shower was very slow to drain and within a few hours the OWNER of Cooper Brown was out to personally de-clog my shower from the last tenant. Impressive. I luckily didn't have any other maintenance issues with my apartment, but I loved that Cooper Brown was easily accessible via email and phone calls, and they always got back to me quickly when I did have questions (or when they had questions for me). Their office is conveniently located in the Biltmore so I often ended up saving my 40-whatever cents and dropping off my rent rather than mailing it, which was nice. \n\nAt moveout, things were equally straightforward and easy. I was able to schedule a moveout inspection on my own time, and Charley was great about going through and explaining what would be taken out of my security deposit (which honestly wasn't much). The way they do their utilities is a little weird: you pay a flat fee each month and then at the end of your lease you either owe more or get money back. They don't provide you with any update of where you stand throughout the year, which would have been nice, but not a big deal. Since I'm a bit of a treehugger and don't really use my thermostat or overhead lighting, I got a nice little chunk of change back with my security deposit. A nice bonus, indeed!", "type": "review", "business_id": "ZKcVHVlD-kwmXFlnPzxpMg"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "2-A4HMd38NioUmylLFTqbA", "review_id": "vPkV3VohWMf7722g-evODQ", "stars": 3, "date": "2009-11-06", "text": "I've been to JP's many, many times as the semester has progressed and have a better feel for their pros and cons now.\n\nPros\n1) Tasty sandwiches and baked goods (cranberry bread is especially delicious)\n2) Atmosphere (comfy couches, ample tables, decent -- if loud -- music)\n3) Proximity to ETC\n\nCons\n1) The drinks.  I'm not a coffee drinker and I've been repeatedly unimpressed with their chai (weak) and hot chocolate (sometimes weak and bitter).  The apple cider is middling.  The tessa thai tea is tasty (try saying that three times fast...), but too sweet to be a regular order.\n2) Sometimes weak/spotty wifi.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bFHiWziKTHO-DZzdwpCAnw", "review_id": "7nKN2OVD8MJ4kSPm2noo0A", "stars": 1, "date": "2011-11-16", "text": "This afternoon I will be going to pick up my deposit from Cooper Brown...I am no longer interested in renting from them for various reasons.  I found a property of theirs online in the Healy Building downtown.  The pictures of the property looked flawless online, but when I went to actually view the property it was filthy and the wooden cabinets were so worn out.  The tile in the shower was scary, and clearly needed to be replaced.  They wanted my deposit which was 45$ higher than the actual rent before my application was even processed, and had no sort of receipt to give me. The condo was listed as having stainless steel appliances, but of course the fridge was steel with black plastic handles and a black microwave.  I won't even get started on the dishwasher.  I was also informed that I would get a confirmation call an hour before the viewing but the agent called me just twenty minutes beforehand.  When I met her there her hair was sopping wet.  I felt this was extremely unprofessional.  I spoke to the receptionist a few days before the viewing and she told me I would not need to have the deposit until after my application had been processed, but of course the agent wanted a check as soon as I saw the place.  These people are confused and have no idea how to make renter/buyer feel confident in their purchase.  My biggest reason for no longer doing business with them is the fact that I told them I needed an immediate move-in and they lolly-gagged with the process because they could not contact my landlord from four years ago, who probably doesn't even remember me! I just told them to forget it and I would be there to pick up my check.  There should not be such a lengthy process for a condo with no parking, black appliances, and a building where young men like to stand out front and socialize.  I would not recommend Cooper Brown to friends or family.", "type": "review", "business_id": "ZKcVHVlD-kwmXFlnPzxpMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ykCl6zgslYko-eL6q8FEXA", "review_id": "vv1iD8OoFoRUhj1BVCPIiQ", "stars": 3, "date": "2011-05-17", "text": "I should be well aware by now that it is common knowledge that coffeehouses don't serve good food. Still, I find this wholly unacceptable at JP's, because given the ample space, comfortable furniture, and sizable patio, people are bound to practically nest there for hours on end; but with the number of signs they have on the walls screaming, \"NO OUTSIDE FOOD OR DRINKS,\" you really have no other choice to satiate your appetite other than to uproot yourself from your seat and just leave. \n\nI've ordered two of their panini: the margherita (basil, provolone, and tomatoes) and the roast beef (horseradish mayonnaise, arugula and brie). Of the two, the roast beef was far more palatable, but I found that in their panini, the big chunks of toasted bread scratch up my gums way too much. Was this really worth $8? As far as drinks go, I'm a fan of the mint hibiscus tea, but I still hesitate at the thought of shelling out $2.50 for a cup containing more ice than tea.\n\nI still recommend JP's as a decent place to chill, hang out, or study, but I am a fervent supporter of good food and drink at a coffeehouse--because what else is going to keep me there?", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uYj44cQ_Sp0QYPGPC98bTw", "review_id": "EtcnLEDAGspNvmyTt27JCA", "stars": 4, "date": "2010-07-02", "text": "A comfortable and affordable spot in Princeton with decent prices and a university-pub ambiance. \n\nI nearly always get the appetizer order of Quesadillas as a meal. They're huge, affordable, and tasty (the not-so-secret special ingredient is bacon). My husband loves the Bistro burger which comes with a generous topping of Brie.\n\nI can also recommend, as a healthier option, the chili meal, which is flavorful, filling, and comes with salad and garlic bread.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZbXdyF_kH-vuyaW4HdBYBA", "review_id": "lKjQITldzs5BNFb_55sKkA", "stars": 3, "date": "2009-05-26", "text": "This place isnt that great for dinner or lunch, but for a cheap happy hour and some good mozerella sticks- this is the place to go.  There arent really any other bars in Princeton!", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4cU8EQXmFUxUpGsgtk72hg", "review_id": "HlPl8Jj7Q2ZqhNbueh7GKg", "stars": 3, "date": "2012-01-10", "text": "JP's is in a really convenient spot for people who exist in the Engineering area on campus (ahem) and not too much of a trek if you're in the northern part of campus. The parking lot is annoyingly small and reliably full but between the main area inside, the small back room, and the patio you're bound to find a place to sit once you're there. Considering how busy Flightpath and Quacks often are, I'm appreciative of this.\n\nJP's is very hit-or-miss for me. When I walk in, get a chai from a friendly barista, and have a seat, I really enjoy the place. That said, I feel like half the time I have a bad experience. For as good as the chai is when I stay in the shop, it's terrible when I have them make it to-go. It's like they're making a different drink entirely, and certainly not one worth the $4.50 they charge for it.\n\nSome of the staff can be downright unfriendly (is it so hard to call out a drink when it's done, rather than making me stand there wondering if it's my order?) while some of the staff are great.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vt7tvWD2O9krt-H8POXAfg", "review_id": "xsUHPOPUJqYXZZLNyuPVLA", "stars": 5, "date": "2012-09-10", "text": "These guys have been keepin my mornings coffeed up for years! Love the deck and they got beer too!", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FArIEoSKbCcVqWc2eWNFXA", "review_id": "TNtbX3xQfyLZgK3X53u9-A", "stars": 4, "date": "2011-06-18", "text": "I've been coming here since I was a kid and am convinced that the food has only improved over the years.  I went to brunch at Winberie's over Memorial Day weekend and was highly impressed.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZbCsc6FLmU3GTuSRrGlCaA", "review_id": "mMKt4PzdvOMhUZacMZL-fg", "stars": 4, "date": "2008-07-20", "text": "The coffee here is outta sight.  That's the main reason to go.  They have one of those clover machines, and it's just fantastic.  One of the best cups of coffee in town.  I remember when they switched from their regular drip coffee to that thing and it was like night and day.  The espresso drinks are also great, and the baristas give a damn about pulling a good shot.\n\nAdd to this the fact that the place is comfy, they have decent breakfast tacos, great music, and a good university crowd, and it's a great coffeeshop.  The one downside is the food, which is less than inspiring, but does in a pinch.  \n\nOne of the other reviewers said this was a \"Republican\" coffeeshop.  Not sure about that, but if it is, it's the best anti-corporate, quality coffee serving, Gillian Welch playing, tattooed barista hiring Republican coffeeshop I've been to, so there ya go.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TKPQEd2AVMERKWB3qtTdhw", "review_id": "YaYteSl0A3ZqkhL8ZZYDQQ", "stars": 4, "date": "2012-01-18", "text": "Been going here for years during and after college.  Just love the coffee and the vibe.  And they remember your name if you go in enough ;)\n\nOf course it has that youthful energy with so many students, but it's not all students. \n\nIt's mainly the coffee that brings me back despite the lack of available parking.  That's the only downside.  Oh and they don't have a bottomless option.  Oh well", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FHcgJtkPKs7ndLKNIzka1Q", "review_id": "d_7TW-qDEUSmqfUM9dNdkA", "stars": 3, "date": "2011-11-29", "text": "This place has decent food. It doesn't have much going for it besides the fact that it has a nice bar. The service is okay and never exceptional. I feel like you can go anywhere and get equal, if not better food.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qq-oztk66aN-si1yd8k0Sw", "review_id": "Xuh97btlYTpfRf-4r2Dz2g", "stars": 4, "date": "2010-04-25", "text": "Very good pub, but best bet is stick with the pub grub.", "type": "review", "business_id": "HIPGr2gSEN4T73tjz47hpw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mGvBuPvN5fHdUbFS0OVsRg", "review_id": "kSYLklKcKAjVMKh1GFDJ-Q", "stars": 5, "date": "2010-08-15", "text": "This place was my lunchtime haven when I worked at horrible place on campus across the road.  I love all the baristas: the sweethearts of the caffeine world. I have been drinking coffee since I was about 10 and it's very seldom that afternoon caffeine feels like it really gets into ma'blooood, but JP's  heroine coffee does the trick. Plus, it's fun to watch the baristas throw down when someone brings in outside food. Look here, Large...Don't nobody wan' hear your crinklin' and smell your burger while trying to enjoy their premium brews!  Oh, they sell beer, too. Tasty selection with $1 Lonestars at some point in the day. Don't know those hours, though. All you need to know is that this place is just lovely.", "type": "review", "business_id": "DARh6yjrGGVZ7R3Gdh4CMA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "7XIHzdQb7ecKLDoLqJYOtA", "review_id": "sNBxC_WsYubcrh-b7JO6WA", "stars": 5, "date": "2010-09-13", "text": "I love that we have this starbucks here on campus...I get a pretty complicated beverage ... And for the most part they always get it right...if they don't ....they know to re-make it...before I unleash my wrath...The manager at this location is super sweet he takes the time to really train his student employees...when you get a 5.50 venti cup almost daily you have certain expectations...", "type": "review", "business_id": "-ilTnXu41RrxQITuolQhmQ"}
{"business_id": "Iu-oeVzv8ZgP18NIB0UMqg", "full_address": "3320 S Hill St\nSouth East LA\nLos Angeles, CA 90007", "schools": ["University of Southern California"], "open": true, "categories": ["Medical Centers", "Health and Medical"], "photo_url": "http://s3-media1.ak.yelpcdn.com/bphoto/SdUWxREuWuPvvot6faxfXg/ms.jpg", "city": "Los Angeles", "review_count": 2, "name": "Southern California Medical Group", "neighborhoods": ["South East LA"], "url": "http://www.yelp.com/biz/southern-california-medical-group-los-angeles", "longitude": -118.274281, "state": "CA", "stars": 3.5, "latitude": 34.019710000000003, "type": "business"}
{"business_id": "ae5tm46-ewAhUJ6HR4fXFA", "full_address": "12 Arrow St\nSte 108\nHarvard Square\nCambridge, MA 02138", "schools": ["Massachusetts Institute of Technology", "Harvard University"], "open": true, "categories": ["Massage", "Beauty and Spas"], "photo_url": "http://s3-media1.ak.yelpcdn.com/bphoto/IGjhD4m7mexe7N06OX9DcA/ms.jpg", "city": "Cambridge", "review_count": 4, "name": "Harvard Square Shiatsu", "neighborhoods": ["Harvard Square"], "url": "http://www.yelp.com/biz/harvard-square-shiatsu-cambridge", "longitude": -71.114815800000002, "state": "MA", "stars": 4.0, "latitude": 42.371132799999998, "type": "business"}
{"business_id": "lb9qELwduFgBo408x2VKOA", "full_address": "19 King St E\n2nd floor\nKitchener, ON N2G", "schools": ["University of Waterloo"], "open": true, "categories": ["Tattoo", "Beauty and Spas"], "photo_url": "http://s3-media1.ak.yelpcdn.com/assets/2/www/img/924a6444ca6c/gfx/blank_biz_medium.gif", "city": "Kitchener", "review_count": 2, "name": "Faith & Glory Collective", "neighborhoods": [], "url": "http://www.yelp.ca/biz/faith-and-glory-collective-kitchener", "longitude": -80.488823999999994, "state": "ON", "stars": 4.0, "latitude": 43.449645199999999, "type": "business"}
{"business_id": "HPWmjuivv3xJ279qSVfNaQ", "full_address": "325 W State St\nWest Lafayette, IN 47906", "schools": ["Purdue University"], "open": true, "categories": ["Music & DVDs", "Books, Mags, Music and Video", "Shopping"], "photo_url": "http://s3-media4.ak.yelpcdn.com/bphoto/tsa18S_FfPGq57sMCm37eQ/ms.jpg", "city": "West Lafayette", "review_count": 3, "name": "Von's Records & Posters", "neighborhoods": [], "url": "http://www.yelp.com/biz/vons-records-and-posters-west-lafayette", "longitude": -86.908764000000005, "state": "IN", "stars": 3.5, "latitude": 40.423963999999998, "type": "business"}
{"business_id": "DARh6yjrGGVZ7R3Gdh4CMA", "full_address": "2803 San Jacinto Blvd\nUniversity of Texas\nAustin, TX 78705", "schools": ["University of Texas - Austin"], "open": true, "categories": ["Food", "Coffee & Tea"], "photo_url": "http://s3-media1.ak.yelpcdn.com/bphoto/7Iv_opbr0RfO_DB-QKoe0g/ms.jpg", "city": "Austin", "review_count": 85, "name": "JP's Java", "neighborhoods": ["University of Texas"], "url": "http://www.yelp.com/biz/jps-java-austin", "longitude": -97.734496199999995, "state": "TX", "stars": 3.5, "latitude": 30.290494500000001, "type": "business"}
{"business_id": "ZKcVHVlD-kwmXFlnPzxpMg", "full_address": "817 West Peachtree Street, Suite 220\nMidtown\nAtlanta, GA 30308", "schools": ["Georgia Institute of Technology"], "open": true, "categories": ["Property Management", "Home Services", "Real Estate"], "photo_url": "http://s3-media1.ak.yelpcdn.com/assets/2/www/img/924a6444ca6c/gfx/blank_biz_medium.gif", "city": "Atlanta", "review_count": 4, "name": "Cooper Brown Real Estate", "neighborhoods": ["Midtown"], "url": "http://www.yelp.com/biz/cooper-brown-real-estate-atlanta", "longitude": -84.387177500000007, "state": "GA", "stars": 3.5, "latitude": 33.776987800000001, "type": "business"}
{"business_id": "HIPGr2gSEN4T73tjz47hpw", "full_address": "1 Palmer Sq E\nPrinceton, NJ 08542", "schools": ["Princeton University"], "open": true, "categories": ["Pubs", "Bars", "American (Traditional)", "Nightlife", "Restaurants"], "photo_url": "http://s3-media1.ak.yelpcdn.com/bphoto/8yGJtkNAqqfG00bInsHFNA/ms.jpg", "city": "Princeton", "review_count": 77, "name": "Winberie's Restaurant & Bar", "neighborhoods": [], "url": "http://www.yelp.com/biz/winberies-restaurant-and-bar-princeton", "longitude": -74.660859099999996, "state": "NJ", "stars": 3.5, "latitude": 40.3497226, "type": "business"}
{"business_id": "A_Fm4v2-gQuGBBI-GBx4Uw", "full_address": "16 Division St\nCohoes, NY 12047", "schools": ["Rensselaer Polytechnic Institute"], "open": true, "categories": ["Pizza", "Restaurants"], "photo_url": "http://s3-media1.ak.yelpcdn.com/assets/2/www/img/924a6444ca6c/gfx/blank_biz_medium.gif", "city": "Cohoes", "review_count": 2, "name": "Joe's Tavern", "neighborhoods": [], "url": "http://www.yelp.com/biz/joes-tavern-cohoes", "longitude": -73.710203899999996, "state": "NY", "stars": 4.0, "latitude": 42.780887800000002, "type": "business"}
{"business_id": "-ilTnXu41RrxQITuolQhmQ", "full_address": "3218 Market St\nUniversity City\nPhiladelphia, PA 19104", "schools": ["University of Pennsylvania"], "open": true, "categories": ["Food", "Coffee & Tea"], "photo_url": "http://s3-media1.ak.yelpcdn.com/bphoto/F6nhU8jSBLh3XEbMYphpmA/ms.jpg", "city": "Philadelphia", "review_count": 4, "name": "Starbucks", "neighborhoods": ["University City"], "url": "http://www.yelp.com/biz/starbucks-philadelphia-8", "longitude": -75.187156299999998, "state": "PA", "stars": 3.0, "latitude": 39.955299699999998, "type": "business"}
{"business_id": "L5ABFgTmN-T-uZjuGpoi3Q", "full_address": "5829 Kirby Dr\nWest University\nHouston, TX 77005", "schools": ["Rice University"], "open": true, "categories": ["Food", "Specialty Food", "Health Markets"], "photo_url": "http://s3-media3.ak.yelpcdn.com/bphoto/ByAD70NTByglzKh9Gny5Og/ms.jpg", "city": "Houston", "review_count": 2, "name": "Vitamin Shoppe", "neighborhoods": ["West University"], "url": "http://www.yelp.com/biz/vitamin-shoppe-houston-3", "longitude": -95.418109999999999, "state": "TX", "stars": 5.0, "latitude": 29.719273999999999, "type": "business"}
{"votes": {"funny": 0, "useful": 10, "cool": 6}, "user_id": "MKArnhRkRH6ZaoY1-21Y3A", "name": "D B.", "url": "http://www.yelp.com/user_details?userid=MKArnhRkRH6ZaoY1-21Y3A", "average_stars": 3.9583333333333299, "review_count": 48, "type": "user"}
{"votes": {"funny": 29, "useful": 84, "cool": 33}, "user_id": "fD1xG9EDq9IvWc0_u4ggFg", "name": "Tai L.", "url": "http://www.yelp.com/user_details?userid=fD1xG9EDq9IvWc0_u4ggFg", "average_stars": 3.77678571428571, "review_count": 112, "type": "user"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Z8uPefqzIjH_pg6o4lGFQ", "name": "L L.", "url": "http://www.yelp.com/user_details?userid=6Z8uPefqzIjH_pg6o4lGFQ", "average_stars": 3.8333333333333299, "review_count": 7, "type": "user"}
{"votes": {"funny": 552, "useful": 763, "cool": 645}, "user_id": "XN7gmypk2antDlllPKFgxQ", "name": "Victor C.", "url": "http://www.yelp.com/user_details?userid=XN7gmypk2antDlllPKFgxQ", "average_stars": 3.7999999999999998, "review_count": 350, "type": "user"}
{"votes": {"funny": 35, "useful": 100, "cool": 82}, "user_id": "7XIHzdQb7ecKLDoLqJYOtA", "name": "Pinkjadez Z.", "url": "http://www.yelp.com/user_details?userid=7XIHzdQb7ecKLDoLqJYOtA", "average_stars": 4.1830985915493004, "review_count": 71, "type": "user"}
{"votes": {"funny": 220, "useful": 512, "cool": 256}, "user_id": "ie3nXtDTyHhJchMuYh_WXQ", "name": "Robert U.", "url": "http://www.yelp.com/user_details?userid=ie3nXtDTyHhJchMuYh_WXQ", "average_stars": 4.1225806451612899, "review_count": 155, "type": "user"}
{"votes": {"funny": 121, "useful": 988, "cool": 698}, "user_id": "-hKniZN2OdshWLHYuj21jQ", "name": "Nicole E.", "url": "http://www.yelp.com/user_details?userid=-hKniZN2OdshWLHYuj21jQ", "average_stars": 3.8854368932038801, "review_count": 515, "type": "user"}
{"votes": {"funny": 231, "useful": 270, "cool": 220}, "user_id": "7qjuo3CHzrCYURqDjHCL9g", "name": "Jon E.", "url": "http://www.yelp.com/user_details?userid=7qjuo3CHzrCYURqDjHCL9g", "average_stars": 3.5972222222222201, "review_count": 72, "type": "user"}
{"votes": {"funny": 8, "useful": 49, "cool": 27}, "user_id": "QF0urZa-0bxga17ZeY-9lw", "name": "Tom W.", "url": "http://www.yelp.com/user_details?userid=QF0urZa-0bxga17ZeY-9lw", "average_stars": 4.0784313725490202, "review_count": 51, "type": "user"}
{"votes": {"funny": 2, "useful": 6, "cool": 1}, "user_id": "1S-QLWu3H3aCbrWmCTtCbA", "name": "Charlie D.", "url": "http://www.yelp.com/user_details?userid=1S-QLWu3H3aCbrWmCTtCbA", "average_stars": 3.5, "review_count": 14, "type": "user"}
{"votes": {"funny": 15, "useful": 21, "cool": 7}, "user_id": "ZbCsc6FLmU3GTuSRrGlCaA", "name": "John B.", "url": "http://www.yelp.com/user_details?userid=ZbCsc6FLmU3GTuSRrGlCaA", "average_stars": 3.6000000000000001, "review_count": 15, "type": "user"}
{"votes": {"funny": 196, "useful": 561, "cool": 335}, "user_id": "OSbuXWZqW4iouNTKibaw6w", "name": "Cara N.", "url": "http://www.yelp.com/user_details?userid=OSbuXWZqW4iouNTKibaw6w", "average_stars": 3.5977011494252902, "review_count": 174, "type": "user"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "vt7tvWD2O9krt-H8POXAfg", "name": "Clowndog B.", "url": "http://www.yelp.com/user_details?userid=vt7tvWD2O9krt-H8POXAfg", "average_stars": 4.8947368421052602, "review_count": 19, "type": "user"}
{"votes": {"funny": 64, "useful": 390, "cool": 159}, "user_id": "7xum1MWf77uibDaSoQyFkA", "name": "Adam M.", "url": "http://www.yelp.com/user_details?userid=7xum1MWf77uibDaSoQyFkA", "average_stars": 3.4691629955947101, "review_count": 454, "type": "user"}
{"votes": {"funny": 4, "useful": 25, "cool": 9}, "user_id": "0HZ-Y3EyE96zmpc2n6k9Ow", "name": "Dan F.", "url": "http://www.yelp.com/user_details?userid=0HZ-Y3EyE96zmpc2n6k9Ow", "average_stars": 3.6219512195122001, "review_count": 84, "type": "user"}
{"votes": {"funny": 10, "useful": 29, "cool": 6}, "user_id": "eOz2IdGXU6NqU_wcaelkDQ", "name": "KC L.", "url": "http://www.yelp.com/user_details?userid=eOz2IdGXU6NqU_wcaelkDQ", "average_stars": 2.9767441860465098, "review_count": 86, "type": "user"}
{"votes": {"funny": 1, "useful": 16, "cool": 11}, "user_id": "5OivyZndZ9_rCbD9dVtERQ", "name": "Stacy S.", "url": "http://www.yelp.com/user_details?userid=5OivyZndZ9_rCbD9dVtERQ", "average_stars": 4.5, "review_count": 8, "type": "user"}
{"votes": {"funny": 46, "useful": 176, "cool": 42}, "user_id": "Mp68LGnhRbzCI57gkW1qGQ", "name": "jay w.", "url": "http://www.yelp.com/user_details?userid=Mp68LGnhRbzCI57gkW1qGQ", "average_stars": 3.1392405063291098, "review_count": 237, "type": "user"}
{"votes": {"funny": 0, "useful": 12, "cool": 7}, "user_id": "EBF0n1alKKytvvx7syZ-uQ", "name": "Ryan M.", "url": "http://www.yelp.com/user_details?userid=EBF0n1alKKytvvx7syZ-uQ", "average_stars": 3.6000000000000001, "review_count": 5, "type": "user"}
{"votes": {"funny": 3, "useful": 53, "cool": 39}, "user_id": "tK4rK-icLbgOSi7z5BWrnQ", "name": "matt m.", "url": "http://www.yelp.com/user_details?userid=tK4rK-icLbgOSi7z5BWrnQ", "average_stars": 4.1315789473684204, "review_count": 38, "type": "user"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "PJbQOPzAhl5oBOSpAoxtmw", "name": "Androo J.", "url": "http://www.yelp.com/user_details?userid=PJbQOPzAhl5oBOSpAoxtmw", "average_stars": 1.6666666666666701, "review_count": 8, "type": "user"}
{"votes": {"funny": 238, "useful": 734, "cool": 253}, "user_id": "BwC6JnnmWP50MS6UubOv6Q", "name": "C S.", "url": "http://www.yelp.com/user_details?userid=BwC6JnnmWP50MS6UubOv6Q", "average_stars": 3.3797814207650299, "review_count": 366, "type": "user"}
{"votes": {"funny": 57, "useful": 121, "cool": 80}, "user_id": "hE-hiLSWdWG1uOPElya0cw", "name": "Amber S.", "url": "http://www.yelp.com/user_details?userid=hE-hiLSWdWG1uOPElya0cw", "average_stars": 4.0, "review_count": 36, "type": "user"}
{"votes": {"funny": 35, "useful": 129, "cool": 47}, "user_id": "o_naR5UiF1GJMDZ7Dkh_dw", "name": "annie w.", "url": "http://www.yelp.com/user_details?userid=o_naR5UiF1GJMDZ7Dkh_dw", "average_stars": 4.1522842639593902, "review_count": 197, "type": "user"}
{"votes": {"funny": 43, "useful": 95, "cool": 78}, "user_id": "x5GMzFRWm37_J5pEU9p5Eg", "name": "Meg L.", "url": "http://www.yelp.com/user_details?userid=x5GMzFRWm37_J5pEU9p5Eg", "average_stars": 3.4285714285714302, "review_count": 49, "type": "user"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "0JTUKfQOugcSKDERwKnC_w", "name": "Tyler D.", "url": "http://www.yelp.com/user_details?userid=0JTUKfQOugcSKDERwKnC_w", "average_stars": 3.75, "review_count": 4, "type": "user"}
{"votes": {"funny": 0, "useful": 8, "cool": 0}, "user_id": "UuP5gkkFltjzcoAuFINHUw", "name": "Stephanie R.", "url": "http://www.yelp.com/user_details?userid=UuP5gkkFltjzcoAuFINHUw", "average_stars": 3.9090909090909101, "review_count": 23, "type": "user"}
{"votes": {"funny": 25, "useful": 58, "cool": 26}, "user_id": "YSygJSSbTPAeQuWIdybKlQ", "name": "Dorothy W.", "url": "http://www.yelp.com/user_details?userid=YSygJSSbTPAeQuWIdybKlQ", "average_stars": 3.6477272727272698, "review_count": 88, "type": "user"}
{"votes": {"funny": 3, "useful": 6, "cool": 4}, "user_id": "7vN1c6P_EgPvBsx-IgJpvA", "name": "Hugo R.", "url": "http://www.yelp.com/user_details?userid=7vN1c6P_EgPvBsx-IgJpvA", "average_stars": 4.0, "review_count": 3, "type": "user"}
{"votes": {"funny": 47, "useful": 110, "cool": 42}, "user_id": "9tIY0VO9W8bT-I2wQM9nWA", "name": "Radhika B.", "url": "http://www.yelp.com/user_details?userid=9tIY0VO9W8bT-I2wQM9nWA", "average_stars": 3.6119402985074598, "review_count": 134, "type": "user"}
{"votes": {"funny": 160, "useful": 296, "cool": 198}, "user_id": "BDyCY898xb7QexX-XJgrEw", "name": "Autumn E.", "url": "http://www.yelp.com/user_details?userid=BDyCY898xb7QexX-XJgrEw", "average_stars": 3.7443609022556399, "review_count": 133, "type": "user"}
{"votes": {"funny": 6, "useful": 20, "cool": 8}, "user_id": "7KS9IjJYPgnNJI2OwXFJjA", "name": "Beth M.", "url": "http://www.yelp.com/user_details?userid=7KS9IjJYPgnNJI2OwXFJjA", "average_stars": 4.06666666666667, "review_count": 30, "type": "user"}
{"votes": {"funny": 61, "useful": 158, "cool": 87}, "user_id": "_vN1zUgCxvfVFabQJw5JvA", "name": "Michael B.", "url": "http://www.yelp.com/user_details?userid=_vN1zUgCxvfVFabQJw5JvA", "average_stars": 3.8142857142857101, "review_count": 70, "type": "user"}
{"votes": {"funny": 39, "useful": 46, "cool": 25}, "user_id": "GLP3Yeie2NGTzAsTfZojcQ", "name": "Arjun B.", "url": "http://www.yelp.com/user_details?userid=GLP3Yeie2NGTzAsTfZojcQ", "average_stars": 4.1785714285714297, "review_count": 28, "type": "user"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "k8o5219XNyon2bBD-dXG2w", "name": "Paul B.", "url": "http://www.yelp.com/user_details?userid=k8o5219XNyon2bBD-dXG2w", "average_stars": 4.5999999999999996, "review_count": 5, "type": "user"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8_PMjGVgQ5VFgcMMl4QtMg", "name": "Tim M.", "url": "http://www.yelp.com/user_details?userid=8_PMjGVgQ5VFgcMMl4QtMg", "average_stars": 2.75, "review_count": 6, "type": "user"}
{"votes": {"funny": 120, "useful": 210, "cool": 81}, "user_id": "VJZPJjgZpO7Slo3_zWtsAg", "name": "Courtney M.", "url": "http://www.yelp.com/user_details?userid=VJZPJjgZpO7Slo3_zWtsAg", "average_stars": 4.1342281879194598, "review_count": 149, "type": "user"}
{"votes": {"funny": 49, "useful": 107, "cool": 53}, "user_id": "IF9jWNtiHUd_UbOGfwHtYw", "name": "Aly K.", "url": "http://www.yelp.com/user_details?userid=IF9jWNtiHUd_UbOGfwHtYw", "average_stars": 3.9056603773584899, "review_count": 159, "type": "user"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GKkkdCphRDRmuaX5BaC_-w", "name": "Chelsea M.", "url": "http://www.yelp.com/user_details?userid=GKkkdCphRDRmuaX5BaC_-w", "average_stars": 3.0, "review_count": 1, "type": "user"}
{"votes": {"funny": 218, "useful": 462, "cool": 302}, "user_id": "AmWBYdyXJRxPKKW6HMhRrQ", "name": "Julia W.", "url": "http://www.yelp.com/user_details?userid=AmWBYdyXJRxPKKW6HMhRrQ", "average_stars": 3.91382405745063, "review_count": 557, "type": "user"}
{"votes": {"funny": 165, "useful": 269, "cool": 134}, "user_id": "zxtZqGUAlyi5MvsxKrDzVQ", "name": "Alex A.", "url": "http://www.yelp.com/user_details?userid=zxtZqGUAlyi5MvsxKrDzVQ", "average_stars": 3.54285714285714, "review_count": 210, "type": "user"}
{"votes": {"funny": 30, "useful": 71, "cool": 34}, "user_id": "jF46UKNQjxEsJFTeSPoPag", "name": "Alexander W.", "url": "http://www.yelp.com/user_details?userid=jF46UKNQjxEsJFTeSPoPag", "average_stars": 3.2727272727272698, "review_count": 44, "type": "user"}
{"votes": {"funny": 15, "useful": 52, "cool": 15}, "user_id": "_wRTBeEpjXvH6oSl2dMhLA", "name": "Dana J.", "url": "http://www.yelp.com/user_details?userid=_wRTBeEpjXvH6oSl2dMhLA", "average_stars": 3.3838383838383801, "review_count": 99, "type": "user"}
{"votes": {"funny": 259, "useful": 1415, "cool": 867}, "user_id": "ouODopBKF3AqfCkuQEnrDg", "name": "Danan R.", "url": "http://www.yelp.com/user_details?userid=ouODopBKF3AqfCkuQEnrDg", "average_stars": 3.5854145854145898, "review_count": 1001, "type": "user"}
{"votes": {"funny": 40, "useful": 159, "cool": 75}, "user_id": "a6EhIkvlAnZeGyBCZ_7OmQ", "name": "Nancy L.", "url": "http://www.yelp.com/user_details?userid=a6EhIkvlAnZeGyBCZ_7OmQ", "average_stars": 3.6540084388185701, "review_count": 237, "type": "user"}
{"votes": {"funny": 64, "useful": 98, "cool": 73}, "user_id": "GDibrLNAg3PeABaOfZ7PcA", "name": "Priscilla W.", "url": "http://www.yelp.com/user_details?userid=GDibrLNAg3PeABaOfZ7PcA", "average_stars": 4.0526315789473699, "review_count": 57, "type": "user"}
{"votes": {"funny": 179, "useful": 561, "cool": 440}, "user_id": "pLlRrcoDrzX7QSlTTcG0ow", "name": "Long T.", "url": "http://www.yelp.com/user_details?userid=pLlRrcoDrzX7QSlTTcG0ow", "average_stars": 4.0149999999999997, "review_count": 400, "type": "user"}
{"votes": {"funny": 173, "useful": 152, "cool": 122}, "user_id": "V-XntDmY9bLdUcnEDwYMpA", "name": "Andrew D.", "url": "http://www.yelp.com/user_details?userid=V-XntDmY9bLdUcnEDwYMpA", "average_stars": 3.1265822784810098, "review_count": 79, "type": "user"}
{"votes": {"funny": 202, "useful": 395, "cool": 281}, "user_id": "FArIEoSKbCcVqWc2eWNFXA", "name": "Caroline B.", "url": "http://www.yelp.com/user_details?userid=FArIEoSKbCcVqWc2eWNFXA", "average_stars": 3.5532786885245899, "review_count": 488, "type": "user"}
{"votes": {"funny": 106, "useful": 262, "cool": 172}, "user_id": "IlbqI2QmRgT-QnjAnv7Y_g", "name": "Chris M.", "url": "http://www.yelp.com/user_details?userid=IlbqI2QmRgT-QnjAnv7Y_g", "average_stars": 3.8098591549295802, "review_count": 142, "type": "user"}
{"votes": {"funny": 77, "useful": 104, "cool": 77}, "user_id": "u9GNxh2nCPKgO5Zhf23vaA", "name": "Ryan G.", "url": "http://www.yelp.com/user_details?userid=u9GNxh2nCPKgO5Zhf23vaA", "average_stars": 4.1764705882352899, "review_count": 68, "type": "user"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "aU5dJ5KhcP8iHBZGi3CzuQ", "name": "Ashley M.", "url": "http://www.yelp.com/user_details?userid=aU5dJ5KhcP8iHBZGi3CzuQ", "average_stars": 4.0, "review_count": 69, "type": "user"}
{"votes": {"funny": 18, "useful": 60, "cool": 17}, "user_id": "mOh1Cpq1Z_xkPA8PcupObg", "name": "Pat B.", "url": "http://www.yelp.com/user_details?userid=mOh1Cpq1Z_xkPA8PcupObg", "average_stars": 3.0625, "review_count": 65, "type": "user"}
{"votes": {"funny": 14, "useful": 57, "cool": 16}, "user_id": "xAzhXanKIkDA02xip6xRKw", "name": "Keith B.", "url": "http://www.yelp.com/user_details?userid=xAzhXanKIkDA02xip6xRKw", "average_stars": 3.7526881720430101, "review_count": 93, "type": "user"}
{"votes": {"funny": 144, "useful": 409, "cool": 295}, "user_id": "RUADiQkUCe-qI5C5_IlFOw", "name": "Sara K.", "url": "http://www.yelp.com/user_details?userid=RUADiQkUCe-qI5C5_IlFOw", "average_stars": 3.9927007299270101, "review_count": 137, "type": "user"}
{"votes": {"funny": 35, "useful": 63, "cool": 19}, "user_id": "4q6sA312pvh_FiAD7wy5-A", "name": "Matthieu K.", "url": "http://www.yelp.com/user_details?userid=4q6sA312pvh_FiAD7wy5-A", "average_stars": 3.5806451612903198, "review_count": 93, "type": "user"}
{"votes": {"funny": 9, "useful": 23, "cool": 4}, "user_id": "GyLhdmxoXHBjz3DFr_4CKw", "name": "Jon A.", "url": "http://www.yelp.com/user_details?userid=GyLhdmxoXHBjz3DFr_4CKw", "average_stars": 3.8181818181818201, "review_count": 33, "type": "user"}
{"votes": {"funny": 29, "useful": 61, "cool": 17}, "user_id": "ZbXdyF_kH-vuyaW4HdBYBA", "name": "Therhyme R.", "url": "http://www.yelp.com/user_details?userid=ZbXdyF_kH-vuyaW4HdBYBA", "average_stars": 3.02564102564103, "review_count": 78, "type": "user"}
{"votes": {"funny": 23, "useful": 118, "cool": 43}, "user_id": "DEXLNhl2iFcIRt7qECuyAg", "name": "Tiffany P.", "url": "http://www.yelp.com/user_details?userid=DEXLNhl2iFcIRt7qECuyAg", "average_stars": 4.0126582278480996, "review_count": 79, "type": "user"}
{"votes": {"funny": 6909, "useful": 11760, "cool": 10380}, "user_id": "YSfAlm6XNaym-JOrRjv3Tg", "name": "Kathleen M.", "url": "http://www.yelp.com/user_details?userid=YSfAlm6XNaym-JOrRjv3Tg", "average_stars": 3.6603527106466398, "review_count": 1531, "type": "user"}
{"votes": {"funny": 297, "useful": 514, "cool": 297}, "user_id": "B5mpfVCviyUl9Bsdef5jUQ", "name": "Brian L.", "url": "http://www.yelp.com/user_details?userid=B5mpfVCviyUl9Bsdef5jUQ", "average_stars": 3.4593698175787702, "review_count": 603, "type": "user"}
{"votes": {"funny": 153, "useful": 328, "cool": 130}, "user_id": "J_M-GT7t8sWGcYyPKsTRVg", "name": "Daniel D.", "url": "http://www.yelp.com/user_details?userid=J_M-GT7t8sWGcYyPKsTRVg", "average_stars": 3.4292929292929299, "review_count": 396, "type": "user"}
{"votes": {"funny": 100, "useful": 335, "cool": 150}, "user_id": "yvgE0bKa3ikEnXiN3MLJDw", "name": "Meredith C.", "url": "http://www.yelp.com/user_details?userid=yvgE0bKa3ikEnXiN3MLJDw", "average_stars": 3.70114942528736, "review_count": 174, "type": "user"}
{"votes": {"funny": 1, "useful": 12, "cool": 2}, "user_id": "XWnDoB40cZY9yDCGjCqUiA", "name": "Jon B.", "url": "http://www.yelp.com/user_details?userid=XWnDoB40cZY9yDCGjCqUiA", "average_stars": 3.28571428571429, "review_count": 14, "type": "user"}
{"votes": {"funny": 4, "useful": 28, "cool": 9}, "user_id": "4cU8EQXmFUxUpGsgtk72hg", "name": "Alex F.", "url": "http://www.yelp.com/user_details?userid=4cU8EQXmFUxUpGsgtk72hg", "average_stars": 3.6666666666666701, "review_count": 33, "type": "user"}
{"votes": {"funny": 26, "useful": 66, "cool": 12}, "user_id": "GpR6-MnjMCxAINKy47rzyA", "name": "Arthur P.", "url": "http://www.yelp.com/user_details?userid=GpR6-MnjMCxAINKy47rzyA", "average_stars": 3.1703296703296702, "review_count": 182, "type": "user"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "hSIZxolwa6prf-25Du0fIw", "name": "Shannon S.", "url": "http://www.yelp.com/user_details?userid=hSIZxolwa6prf-25Du0fIw", "average_stars": 3.7647058823529398, "review_count": 17, "type": "user"}
{"votes": {"funny": 29, "useful": 30, "cool": 23}, "user_id": "MscSHzC119iiDRF1KggwPg", "name": "Joe H.", "url": "http://www.yelp.com/user_details?userid=MscSHzC119iiDRF1KggwPg", "average_stars": 3.6428571428571401, "review_count": 14, "type": "user"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "TDsxf1U-orP85pO3iMBWyA", "name": "Isaac H.", "url": "http://www.yelp.com/user_details?userid=TDsxf1U-orP85pO3iMBWyA", "average_stars": 4.1739130434782599, "review_count": 23, "type": "user"}
{"votes": {"funny": 11, "useful": 27, "cool": 12}, "user_id": "VPZ6_LS5BwCJ9iiNvMeZUw", "name": "alexander B.", "url": "http://www.yelp.com/user_details?userid=VPZ6_LS5BwCJ9iiNvMeZUw", "average_stars": 3.28571428571429, "review_count": 14, "type": "user"}
{"votes": {"funny": 0, "useful": 8, "cool": 6}, "user_id": "9vXRim_pJcX1XUQ9tmkQ9Q", "name": "David L.", "url": "http://www.yelp.com/user_details?userid=9vXRim_pJcX1XUQ9tmkQ9Q", "average_stars": 3.625, "review_count": 17, "type": "user"}
{"votes": {"funny": 77, "useful": 226, "cool": 106}, "user_id": "9a0Pa7qSLT2EAVyITfBUew", "name": "Patrick L.", "url": "http://www.yelp.com/user_details?userid=9a0Pa7qSLT2EAVyITfBUew", "average_stars": 3.6902654867256599, "review_count": 113, "type": "user"}
{"votes": {"funny": 2, "useful": 29, "cool": 3}, "user_id": "sg-X_8sd4H-iyuHFyZGHgQ", "name": "Stacey G.", "url": "http://www.yelp.com/user_details?userid=sg-X_8sd4H-iyuHFyZGHgQ", "average_stars": 4.0526315789473699, "review_count": 19, "type": "user"}
{"votes": {"funny": 66, "useful": 405, "cool": 203}, "user_id": "2-A4HMd38NioUmylLFTqbA", "name": "Christine M.", "url": "http://www.yelp.com/user_details?userid=2-A4HMd38NioUmylLFTqbA", "average_stars": 3.8500000000000001, "review_count": 140, "type": "user"}
{"votes": {"funny": 340, "useful": 415, "cool": 338}, "user_id": "ykCl6zgslYko-eL6q8FEXA", "name": "Mary V.", "url": "http://www.yelp.com/user_details?userid=ykCl6zgslYko-eL6q8FEXA", "average_stars": 3.9393939393939399, "review_count": 132, "type": "user"}
{"votes": {"funny": 54, "useful": 48, "cool": 21}, "user_id": "U-DhIbadXOHDr_vEGe0efw", "name": "Inez N.", "url": "http://www.yelp.com/user_details?userid=U-DhIbadXOHDr_vEGe0efw", "average_stars": 3.25, "review_count": 20, "type": "user"}
{"votes": {"funny": 2583, "useful": 4385, "cool": 3315}, "user_id": "LYXc1p5VH4ny-KO2-W1_eQ", "name": "Michelle C.", "url": "http://www.yelp.com/user_details?userid=LYXc1p5VH4ny-KO2-W1_eQ", "average_stars": 3.7240259740259698, "review_count": 616, "type": "user"}
{"votes": {"funny": 104, "useful": 158, "cool": 78}, "user_id": "Qq8_wsGicIneUeA9XJYaWQ", "name": "AnneMarie F.", "url": "http://www.yelp.com/user_details?userid=Qq8_wsGicIneUeA9XJYaWQ", "average_stars": 3.28571428571429, "review_count": 98, "type": "user"}
{"votes": {"funny": 7, "useful": 33, "cool": 12}, "user_id": "-TdnnNdi7xAW-xR7lcEXXQ", "name": "Carlos S.", "url": "http://www.yelp.com/user_details?userid=-TdnnNdi7xAW-xR7lcEXXQ", "average_stars": 4.0, "review_count": 54, "type": "user"}
{"votes": {"funny": 34, "useful": 112, "cool": 67}, "user_id": "dKA5pV924YpE3zmAzShLcw", "name": "Kate F.", "url": "http://www.yelp.com/user_details?userid=dKA5pV924YpE3zmAzShLcw", "average_stars": 3.8712871287128698, "review_count": 101, "type": "user"}
{"votes": {"funny": 34, "useful": 63, "cool": 35}, "user_id": "aIXrSPFM0NREmpeM_3y-gQ", "name": "Jeff T.", "url": "http://www.yelp.com/user_details?userid=aIXrSPFM0NREmpeM_3y-gQ", "average_stars": 3.4375, "review_count": 16, "type": "user"}
{"votes": {"funny": 171, "useful": 980, "cool": 310}, "user_id": "JXbz8URET4T6SWVrDmKWTA", "name": "Janelle M.", "url": "http://www.yelp.com/user_details?userid=JXbz8URET4T6SWVrDmKWTA", "average_stars": 3.3382352941176499, "review_count": 408, "type": "user"}
{"votes": {"funny": 99, "useful": 131, "cool": 98}, "user_id": "BibABXggCleZ4QNjiOjJkQ", "name": "Eugene L.", "url": "http://www.yelp.com/user_details?userid=BibABXggCleZ4QNjiOjJkQ", "average_stars": 4.0705882352941201, "review_count": 85, "type": "user"}
{"votes": {"funny": 65, "useful": 117, "cool": 74}, "user_id": "aFlKAkig9Yk312cL7ZMiKg", "name": "Raymond S.", "url": "http://www.yelp.com/user_details?userid=aFlKAkig9Yk312cL7ZMiKg", "average_stars": 3.7464788732394401, "review_count": 71, "type": "user"}
{"votes": {"funny": 42, "useful": 347, "cool": 135}, "user_id": "LXvn-Wl2Sjzvl_7TxK-x6g", "name": "Christine R.", "url": "http://www.yelp.com/user_details?userid=LXvn-Wl2Sjzvl_7TxK-x6g", "average_stars": 3.79941860465116, "review_count": 344, "type": "user"}
{"votes": {"funny": 1, "useful": 10, "cool": 4}, "user_id": "IaWYbkeRPHSyiMqB5VSf3g", "name": "barbara m.", "url": "http://www.yelp.com/user_details?userid=IaWYbkeRPHSyiMqB5VSf3g", "average_stars": 4.0, "review_count": 16, "type": "user"}
{"votes": {"funny": 510, "useful": 1258, "cool": 652}, "user_id": "PdpWp_j67Nfr_oQF-4yKUw", "name": "Kenneth R.", "url": "http://www.yelp.com/user_details?userid=PdpWp_j67Nfr_oQF-4yKUw", "average_stars": 3.7834394904458599, "review_count": 628, "type": "user"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "6mrFK4e6oUBfebSlMCy21A", "name": "RD L.", "url": "http://www.yelp.com/user_details?userid=6mrFK4e6oUBfebSlMCy21A", "average_stars": 3.7999999999999998, "review_count": 5, "type": "user"}
{"votes": {"funny": 11, "useful": 20, "cool": 21}, "user_id": "0w-7pZtHcgGbdlBXupkiWA", "name": "Lavanna M.", "url": "http://www.yelp.com/user_details?userid=0w-7pZtHcgGbdlBXupkiWA", "average_stars": 4.125, "review_count": 8, "type": "user"}
{"votes": {"funny": 30, "useful": 75, "cool": 36}, "user_id": "KPiykM_x8L-UUKzojrpu_w", "name": "Vannezsa S.", "url": "http://www.yelp.com/user_details?userid=KPiykM_x8L-UUKzojrpu_w", "average_stars": 3.2638888888888902, "review_count": 72, "type": "user"}
{"votes": {"funny": 33, "useful": 144, "cool": 72}, "user_id": "-x0LnzxW1e3jhdzitPWM5w", "name": "Paul L.", "url": "http://www.yelp.com/user_details?userid=-x0LnzxW1e3jhdzitPWM5w", "average_stars": 3.7636363636363601, "review_count": 110, "type": "user"}
{"votes": {"funny": 9, "useful": 25, "cool": 11}, "user_id": "_dAgm9X9Gv_TuIT38npLyg", "name": "Derek K.", "url": "http://www.yelp.com/user_details?userid=_dAgm9X9Gv_TuIT38npLyg", "average_stars": 3.7586206896551699, "review_count": 29, "type": "user"}
{"votes": {"funny": 2, "useful": 9, "cool": 5}, "user_id": "BPQnqug6aYmfwynwSIjZFQ", "name": "Jacques C.", "url": "http://www.yelp.com/user_details?userid=BPQnqug6aYmfwynwSIjZFQ", "average_stars": 2.8260869565217401, "review_count": 24, "type": "user"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-OjFJxfWPpZgVEN6yHVq8w", "name": "Andrew M.", "url": "http://www.yelp.com/user_details?userid=-OjFJxfWPpZgVEN6yHVq8w", "average_stars": 4.4000000000000004, "review_count": 15, "type": "user"}
{"votes": {"funny": 170, "useful": 317, "cool": 155}, "user_id": "qRg_8ByuH12bAd5Yjvxu0g", "name": "Bryan R.", "url": "http://www.yelp.com/user_details?userid=qRg_8ByuH12bAd5Yjvxu0g", "average_stars": 3.7489177489177501, "review_count": 231, "type": "user"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "H3MRgiKXcccSGlGoejcxxQ", "name": "Edward K.", "url": "http://www.yelp.com/user_details?userid=H3MRgiKXcccSGlGoejcxxQ", "average_stars": 2.0, "review_count": 8, "type": "user"}
{"votes": {"funny": 15, "useful": 40, "cool": 10}, "user_id": "A3ezL0M4Irb-NqbezjPi5w", "name": "Jennifer P.", "url": "http://www.yelp.com/user_details?userid=A3ezL0M4Irb-NqbezjPi5w", "average_stars": 2.9285714285714302, "review_count": 28, "type": "user"}
{"votes": {"funny": 105, "useful": 255, "cool": 92}, "user_id": "5dSxCFW9nBJhi-yt_3Px8g", "name": "Trevor F.", "url": "http://www.yelp.com/user_details?userid=5dSxCFW9nBJhi-yt_3Px8g", "average_stars": 3.4112149532710299, "review_count": 535, "type": "user"}
{"votes": {"funny": 149, "useful": 297, "cool": 173}, "user_id": "EMn0Zzaijk2L-fyK2EtG8Q", "name": "Randall S.", "url": "http://www.yelp.com/user_details?userid=EMn0Zzaijk2L-fyK2EtG8Q", "average_stars": 3.48230088495575, "review_count": 226, "type": "user"}
{"votes": {"funny": 2, "useful": 8, "cool": 8}, "user_id": "PTtw3cOMoB_XN-ZtxXc4RA", "name": "Ivo P.", "url": "http://www.yelp.com/user_details?userid=PTtw3cOMoB_XN-ZtxXc4RA", "average_stars": 4.2999999999999998, "review_count": 10, "type": "user"}
{"votes": {"funny": 112, "useful": 682, "cool": 397}, "user_id": "Lr3Nlbzp3b31KooZPvrrdQ", "name": "Tracey S.", "url": "http://www.yelp.com/user_details?userid=Lr3Nlbzp3b31KooZPvrrdQ", "average_stars": 4.03899721448468, "review_count": 359, "type": "user"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "cjp4s2vYqvbtqawlAaVcLA", "name": "Christopher T.", "url": "http://www.yelp.com/user_details?userid=cjp4s2vYqvbtqawlAaVcLA", "average_stars": 3.6000000000000001, "review_count": 5, "type": "user"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "aenRRdScxRH4etTadetOMA", "name": "Amber T.", "url": "http://www.yelp.com/user_details?userid=aenRRdScxRH4etTadetOMA", "average_stars": 4.28571428571429, "review_count": 9, "type": "user"}
{"votes": {"funny": 206, "useful": 894, "cool": 577}, "user_id": "R0KVWeN9xR-F6j4z5k9wXQ", "name": "Meridith H.", "url": "http://www.yelp.com/user_details?userid=R0KVWeN9xR-F6j4z5k9wXQ", "average_stars": 3.6355353075170802, "review_count": 439, "type": "user"}
{"votes": {"funny": 37, "useful": 170, "cool": 54}, "user_id": "0FCZaeAh6Gc85iSWFXOm3g", "name": "Shannon T.", "url": "http://www.yelp.com/user_details?userid=0FCZaeAh6Gc85iSWFXOm3g", "average_stars": 3.8910256410256401, "review_count": 156, "type": "user"}
{"votes": {"funny": 1, "useful": 6, "cool": 0}, "user_id": "IaLqHbCIUJeDVRUsp-sjvg", "name": "Chelsea M.", "url": "http://www.yelp.com/user_details?userid=IaLqHbCIUJeDVRUsp-sjvg", "average_stars": 2.0, "review_count": 6, "type": "user"}
{"votes": {"funny": 3, "useful": 7, "cool": 1}, "user_id": "Y2JDfqEkbSdiInetOL2w5Q", "name": "Brooke M.", "url": "http://www.yelp.com/user_details?userid=Y2JDfqEkbSdiInetOL2w5Q", "average_stars": 3.0, "review_count": 13, "type": "user"}
{"votes": {"funny": 20, "useful": 75, "cool": 33}, "user_id": "Zu0XNq8YnVBNFfRXuv727A", "name": "Paul H.", "url": "http://www.yelp.com/user_details?userid=Zu0XNq8YnVBNFfRXuv727A", "average_stars": 3.7578125, "review_count": 128, "type": "user"}
{"votes": {"funny": 117, "useful": 166, "cool": 153}, "user_id": "mYO_f9LkEybqZV3SUCKcLg", "name": "Brad F.", "url": "http://www.yelp.com/user_details?userid=mYO_f9LkEybqZV3SUCKcLg", "average_stars": 3.4157303370786498, "review_count": 89, "type": "user"}
{"votes": {"funny": 17, "useful": 74, "cool": 19}, "user_id": "dK2YRuRRlchR3Qe8c-bkSA", "name": "Jon M.", "url": "http://www.yelp.com/user_details?userid=dK2YRuRRlchR3Qe8c-bkSA", "average_stars": 4.1578947368421098, "review_count": 76, "type": "user"}
{"votes": {"funny": 24, "useful": 42, "cool": 9}, "user_id": "oVU2xcHYC-Fj4gg_-HaUOA", "name": "Andy T.", "url": "http://www.yelp.com/user_details?userid=oVU2xcHYC-Fj4gg_-HaUOA", "average_stars": 3.7272727272727302, "review_count": 45, "type": "user"}
{"votes": {"funny": 5, "useful": 12, "cool": 8}, "user_id": "Ll9cXJlbMxLKiKcJCHC1gw", "name": "Kevin W.", "url": "http://www.yelp.com/user_details?userid=Ll9cXJlbMxLKiKcJCHC1gw", "average_stars": 4.28571428571429, "review_count": 28, "type": "user"}
{"votes": {"funny": 47, "useful": 102, "cool": 57}, "user_id": "A00hZsgc8RQzve2XkOhe8A", "name": "phil r.", "url": "http://www.yelp.com/user_details?userid=A00hZsgc8RQzve2XkOhe8A", "average_stars": 3.5454545454545499, "review_count": 55, "type": "user"}
{"votes": {"funny": 25, "useful": 51, "cool": 19}, "user_id": "3BrP0927h_vleU_3UAQ_Lw", "name": "Allison Z.", "url": "http://www.yelp.com/user_details?userid=3BrP0927h_vleU_3UAQ_Lw", "average_stars": 3.9500000000000002, "review_count": 60, "type": "user"}
{"votes": {"funny": 293, "useful": 478, "cool": 359}, "user_id": "gV9Y1fHKqnMRExRErIvFag", "name": "Eric M.", "url": "http://www.yelp.com/user_details?userid=gV9Y1fHKqnMRExRErIvFag", "average_stars": 3.3958333333333299, "review_count": 144, "type": "user"}
{"votes": {"funny": 2, "useful": 14, "cool": 3}, "user_id": "FHcgJtkPKs7ndLKNIzka1Q", "name": "Meg M.", "url": "http://www.yelp.com/user_details?userid=FHcgJtkPKs7ndLKNIzka1Q", "average_stars": 3.5, "review_count": 15, "type": "user"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Jonnt0r5l8Bp9dXq4fv-ow", "name": "Humberto G.", "url": "http://www.yelp.com/user_details?userid=Jonnt0r5l8Bp9dXq4fv-ow", "average_stars": 4.0, "review_count": 2, "type": "user"}
{"votes": {"funny": 56, "useful": 169, "cool": 64}, "user_id": "q6qbBT2o-OcLmpQJTFboDw", "name": "Lady R.", "url": "http://www.yelp.com/user_details?userid=q6qbBT2o-OcLmpQJTFboDw", "average_stars": 3.57462686567164, "review_count": 134, "type": "user"}
{"votes": {"funny": 13, "useful": 46, "cool": 22}, "user_id": "DTMqqEV0BIwVYIhUxThbcg", "name": "Shawn S.", "url": "http://www.yelp.com/user_details?userid=DTMqqEV0BIwVYIhUxThbcg", "average_stars": 3.9285714285714302, "review_count": 28, "type": "user"}
{"votes": {"funny": 12, "useful": 38, "cool": 12}, "user_id": "_jqOM382Dhyqp2MN6A4t6g", "name": "Lauren B.", "url": "http://www.yelp.com/user_details?userid=_jqOM382Dhyqp2MN6A4t6g", "average_stars": 3.375, "review_count": 65, "type": "user"}
{"votes": {"funny": 5, "useful": 40, "cool": 14}, "user_id": "LLJkjnNBXqx4bHtlHxeb5A", "name": "Tammy R.", "url": "http://www.yelp.com/user_details?userid=LLJkjnNBXqx4bHtlHxeb5A", "average_stars": 3.3548387096774199, "review_count": 31, "type": "user"}
{"votes": {"funny": 153, "useful": 311, "cool": 129}, "user_id": "SNURSQilbXoezzcg1m9zVA", "name": "Andre P.", "url": "http://www.yelp.com/user_details?userid=SNURSQilbXoezzcg1m9zVA", "average_stars": 4.0106382978723403, "review_count": 376, "type": "user"}
{"votes": {"funny": 8, "useful": 29, "cool": 6}, "user_id": "oIorTSlDXx68CrugO2aRCg", "name": "Emily A.", "url": "http://www.yelp.com/user_details?userid=oIorTSlDXx68CrugO2aRCg", "average_stars": 3.6296296296296302, "review_count": 27, "type": "user"}
{"votes": {"funny": 34, "useful": 139, "cool": 65}, "user_id": "XQKDm_voMjyHHjfSQri_IA", "name": "Steve N.", "url": "http://www.yelp.com/user_details?userid=XQKDm_voMjyHHjfSQri_IA", "average_stars": 3.7813765182186199, "review_count": 247, "type": "user"}
{"votes": {"funny": 3, "useful": 6, "cool": 0}, "user_id": "cAb-WlrO_Yr7a2ld5UMUAg", "name": "Tad D.", "url": "http://www.yelp.com/user_details?userid=cAb-WlrO_Yr7a2ld5UMUAg", "average_stars": 3.5555555555555598, "review_count": 9, "type": "user"}
{"votes": {"funny": 67, "useful": 170, "cool": 95}, "user_id": "pzyKIwEUp8axXqlRCUUfqg", "name": "Elena C.", "url": "http://www.yelp.com/user_details?userid=pzyKIwEUp8axXqlRCUUfqg", "average_stars": 3.9660194174757302, "review_count": 206, "type": "user"}
{"votes": {"funny": 24, "useful": 111, "cool": 54}, "user_id": "eNHZABmkbd-6S5WZtmXC8A", "name": "Wayne S.", "url": "http://www.yelp.com/user_details?userid=eNHZABmkbd-6S5WZtmXC8A", "average_stars": 4.0131578947368398, "review_count": 76, "type": "user"}
{"votes": {"funny": 27, "useful": 44, "cool": 17}, "user_id": "62f7eUnn3O-RZPuSEdX95g", "name": "B B.", "url": "http://www.yelp.com/user_details?userid=62f7eUnn3O-RZPuSEdX95g", "average_stars": 3.75, "review_count": 20, "type": "user"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "vQqyGt8CgI1iypgR3G8RWA", "name": "Carrie D.", "url": "http://www.yelp.com/user_details?userid=vQqyGt8CgI1iypgR3G8RWA", "average_stars": 3.8695652173913002, "review_count": 26, "type": "user"}
{"votes": {"funny": 9, "useful": 16, "cool": 9}, "user_id": "mGvBuPvN5fHdUbFS0OVsRg", "name": "Grace H.", "url": "http://www.yelp.com/user_details?userid=mGvBuPvN5fHdUbFS0OVsRg", "average_stars": 4.0, "review_count": 12, "type": "user"}
{"votes": {"funny": 40, "useful": 66, "cool": 29}, "user_id": "fj3lVmBpz9DF9pYVl9Xj7Q", "name": "Liz B.", "url": "http://www.yelp.com/user_details?userid=fj3lVmBpz9DF9pYVl9Xj7Q", "average_stars": 3.8787878787878798, "review_count": 66, "type": "user"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "bFHiWziKTHO-DZzdwpCAnw", "name": "A. Ann-Marie T.", "url": "http://www.yelp.com/user_details?userid=bFHiWziKTHO-DZzdwpCAnw", "average_stars": 2.0, "review_count": 5, "type": "user"}
{"votes": {"funny": 0, "useful": 7, "cool": 2}, "user_id": "3K_E9m8mRtkYMloDeyjhfw", "name": "Marria K.", "url": "http://www.yelp.com/user_details?userid=3K_E9m8mRtkYMloDeyjhfw", "average_stars": 5.0, "review_count": 3, "type": "user"}
{"votes": {"funny": 136, "useful": 425, "cool": 274}, "user_id": "HGBHupu8mWzRGM0aeXaNcA", "name": "Nathan L.", "url": "http://www.yelp.com/user_details?userid=HGBHupu8mWzRGM0aeXaNcA", "average_stars": 3.7861445783132499, "review_count": 332, "type": "user"}
{"votes": {"funny": 3, "useful": 12, "cool": 9}, "user_id": "tI6UME6YbdxB9Tv30iry8g", "name": "Mai K.", "url": "http://www.yelp.com/user_details?userid=tI6UME6YbdxB9Tv30iry8g", "average_stars": 3.8181818181818201, "review_count": 22, "type": "user"}
{"votes": {"funny": 18, "useful": 55, "cool": 25}, "user_id": "B_294BHLjc922J2ujQdplQ", "name": "Tamara J.", "url": "http://www.yelp.com/user_details?userid=B_294BHLjc922J2ujQdplQ", "average_stars": 3.28571428571429, "review_count": 42, "type": "user"}
{"votes": {"funny": 320, "useful": 1038, "cool": 581}, "user_id": "AG1ETqbneinRRJUeA8PfSA", "name": "Sarah M.", "url": "http://www.yelp.com/user_details?userid=AG1ETqbneinRRJUeA8PfSA", "average_stars": 3.5925058548009399, "review_count": 427, "type": "user"}
{"votes": {"funny": 36, "useful": 66, "cool": 39}, "user_id": "phMJToNw7FWLX9oKzoAsYg", "name": "Andrea K.", "url": "http://www.yelp.com/user_details?userid=phMJToNw7FWLX9oKzoAsYg", "average_stars": 3.9583333333333299, "review_count": 24, "type": "user"}
{"votes": {"funny": 189, "useful": 500, "cool": 242}, "user_id": "Myap53reYBrsN8E9KqwupA", "name": "Mark L.", "url": "http://www.yelp.com/user_details?userid=Myap53reYBrsN8E9KqwupA", "average_stars": 3.70958904109589, "review_count": 365, "type": "user"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jIiPMlQs-OaztONWFhFt5A", "name": "Cansu B.", "url": "http://www.yelp.com/user_details?userid=jIiPMlQs-OaztONWFhFt5A", "average_stars": 3.7272727272727302, "review_count": 11, "type": "user"}
{"votes": {"funny": 9, "useful": 29, "cool": 13}, "user_id": "V7J6mdryEdILbraeA7r5LA", "name": "Nick L.", "url": "http://www.yelp.com/user_details?userid=V7J6mdryEdILbraeA7r5LA", "average_stars": 3.9285714285714302, "review_count": 42, "type": "user"}
{"votes": {"funny": 2, "useful": 31, "cool": 6}, "user_id": "7zvIwVHtMM0RW8hatGs6YQ", "name": "Jesse C.", "url": "http://www.yelp.com/user_details?userid=7zvIwVHtMM0RW8hatGs6YQ", "average_stars": 3.4680851063829801, "review_count": 47, "type": "user"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "LjYqwxwOzVnf6EuYUwuhQg", "name": "Little P.", "url": "http://www.yelp.com/user_details?userid=LjYqwxwOzVnf6EuYUwuhQg", "average_stars": 3.2000000000000002, "review_count": 5, "type": "user"}
{"votes": {"funny": 37, "useful": 60, "cool": 34}, "user_id": "8EREGfplbS2s2MkZtXe4cQ", "name": "Skyler T.", "url": "http://www.yelp.com/user_details?userid=8EREGfplbS2s2MkZtXe4cQ", "average_stars": 3.7619047619047601, "review_count": 42, "type": "user"}
{"votes": {"funny": 460, "useful": 1329, "cool": 813}, "user_id": "XDnlriVXnZgFYXHqphBJ3g", "name": "Kristen F.", "url": "http://www.yelp.com/user_details?userid=XDnlriVXnZgFYXHqphBJ3g", "average_stars": 3.5828402366863901, "review_count": 676, "type": "user"}
{"votes": {"funny": 79, "useful": 199, "cool": 106}, "user_id": "3XuxSvex3zN7IznwCmH5EA", "name": "Alexis J.", "url": "http://www.yelp.com/user_details?userid=3XuxSvex3zN7IznwCmH5EA", "average_stars": 3.4712643678160902, "review_count": 174, "type": "user"}
{"votes": {"funny": 24, "useful": 130, "cool": 74}, "user_id": "g3-4LSFaRu_mDMFg6-SX5w", "name": "Ari M.", "url": "http://www.yelp.com/user_details?userid=g3-4LSFaRu_mDMFg6-SX5w", "average_stars": 4.2692307692307701, "review_count": 78, "type": "user"}
{"votes": {"funny": 51, "useful": 260, "cool": 89}, "user_id": "wo-LvQxKQGV_s9ESqioQ-g", "name": "Daria C.", "url": "http://www.yelp.com/user_details?userid=wo-LvQxKQGV_s9ESqioQ-g", "average_stars": 3.7914438502673802, "review_count": 187, "type": "user"}
{"votes": {"funny": 23, "useful": 63, "cool": 24}, "user_id": "FZGQRklf78yNeF_NtWGfuA", "name": "justin d.", "url": "http://www.yelp.com/user_details?userid=FZGQRklf78yNeF_NtWGfuA", "average_stars": 2.5961538461538498, "review_count": 52, "type": "user"}
{"votes": {"funny": 6, "useful": 64, "cool": 12}, "user_id": "1tRhFdJgkcVtLg2lpMlN_Q", "name": "Nateoc O.", "url": "http://www.yelp.com/user_details?userid=1tRhFdJgkcVtLg2lpMlN_Q", "average_stars": 4.0877192982456103, "review_count": 57, "type": "user"}
{"votes": {"funny": 201, "useful": 526, "cool": 309}, "user_id": "lS8FHMmWEnpEl2IaIrCNnw", "name": "Alexandra L.", "url": "http://www.yelp.com/user_details?userid=lS8FHMmWEnpEl2IaIrCNnw", "average_stars": 3.8921568627451002, "review_count": 306, "type": "user"}
{"votes": {"funny": 18, "useful": 14, "cool": 6}, "user_id": "tpxb4XDEW3HM8rO5gPiFDA", "name": "Albert C.", "url": "http://www.yelp.com/user_details?userid=tpxb4XDEW3HM8rO5gPiFDA", "average_stars": 3.6000000000000001, "review_count": 30, "type": "user"}
{"votes": {"funny": 11, "useful": 82, "cool": 23}, "user_id": "yNgQMxwdkU1RHu0kqQuCzA", "name": "Dorit K.", "url": "http://www.yelp.com/user_details?userid=yNgQMxwdkU1RHu0kqQuCzA", "average_stars": 3.64233576642336, "review_count": 137, "type": "user"}
{"votes": {"funny": 18, "useful": 47, "cool": 25}, "user_id": "119ZDdr0y9mFR8L7oYFSvA", "name": "T S.", "url": "http://www.yelp.com/user_details?userid=119ZDdr0y9mFR8L7oYFSvA", "average_stars": 3.4230769230769198, "review_count": 26, "type": "user"}
{"votes": {"funny": 15, "useful": 67, "cool": 21}, "user_id": "-1_hWlxJbX-H-GbCJ0mgsQ", "name": "Jason D.", "url": "http://www.yelp.com/user_details?userid=-1_hWlxJbX-H-GbCJ0mgsQ", "average_stars": 3.4285714285714302, "review_count": 56, "type": "user"}
{"votes": {"funny": 385, "useful": 803, "cool": 666}, "user_id": "1s1J_yyl4Auhf2oi6ge5Iw", "name": "Felecia I.", "url": "http://www.yelp.com/user_details?userid=1s1J_yyl4Auhf2oi6ge5Iw", "average_stars": 4.1031746031746001, "review_count": 252, "type": "user"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "IE-xwQFolI5D9vs3hvoiZg", "name": "Min J.", "url": "http://www.yelp.com/user_details?userid=IE-xwQFolI5D9vs3hvoiZg", "average_stars": 3.7999999999999998, "review_count": 5, "type": "user"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sfLRoz-80vVFhYKumHrPQg", "name": "Steve C.", "url": "http://www.yelp.com/user_details?userid=sfLRoz-80vVFhYKumHrPQg", "average_stars": 3.0, "review_count": 5, "type": "user"}
{"votes": {"funny": 36, "useful": 108, "cool": 33}, "user_id": "YOIorhfo8hHhilRyam2c4w", "name": "John  K.", "url": "http://www.yelp.com/user_details?userid=YOIorhfo8hHhilRyam2c4w", "average_stars": 3.3542600896860999, "review_count": 223, "type": "user"}
{"votes": {"funny": 112, "useful": 253, "cool": 211}, "user_id": "RoWVC_rLZ85fFJrw6G8urg", "name": "Madeleine M.", "url": "http://www.yelp.com/user_details?userid=RoWVC_rLZ85fFJrw6G8urg", "average_stars": 4.0823529411764703, "review_count": 85, "type": "user"}
{"votes": {"funny": 0, "useful": 7, "cool": 2}, "user_id": "Qq-oztk66aN-si1yd8k0Sw", "name": "Mark D.", "url": "http://www.yelp.com/user_details?userid=Qq-oztk66aN-si1yd8k0Sw", "average_stars": 3.75, "review_count": 20, "type": "user"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wnvJig9i32WcOMsEVqgw9A", "name": "Bryan B.", "url": "http://www.yelp.com/user_details?userid=wnvJig9i32WcOMsEVqgw9A", "average_stars": 4.2000000000000002, "review_count": 6, "type": "user"}
{"votes": {"funny": 22, "useful": 34, "cool": 13}, "user_id": "pNHnFm_YybxPrtwfbbs7HA", "name": "Sydney T.", "url": "http://www.yelp.com/user_details?userid=pNHnFm_YybxPrtwfbbs7HA", "average_stars": 3.4594594594594601, "review_count": 37, "type": "user"}
{"votes": {"funny": 8, "useful": 19, "cool": 7}, "user_id": "TKPQEd2AVMERKWB3qtTdhw", "name": "Nathan N.", "url": "http://www.yelp.com/user_details?userid=TKPQEd2AVMERKWB3qtTdhw", "average_stars": 3.7777777777777799, "review_count": 18, "type": "user"}
{"votes": {"funny": 2, "useful": 28, "cool": 4}, "user_id": "uYj44cQ_Sp0QYPGPC98bTw", "name": "Kara L.", "url": "http://www.yelp.com/user_details?userid=uYj44cQ_Sp0QYPGPC98bTw", "average_stars": 4.1470588235294104, "review_count": 34, "type": "user"}
{"votes": {"funny": 0, "useful": 14, "cool": 3}, "user_id": "55czgsnxb0TBahmmeqO3jQ", "name": "Eric Z.", "url": "http://www.yelp.com/user_details?userid=55czgsnxb0TBahmmeqO3jQ", "average_stars": 3.28571428571429, "review_count": 35, "type": "user"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Sje5nwf_MJVz6v2Q7B-Jzg", "name": "Chris M.", "url": "http://www.yelp.com/user_details?userid=Sje5nwf_MJVz6v2Q7B-Jzg", "average_stars": 3.8333333333333299, "review_count": 7, "type": "user"}
{"votes": {"funny": 1, "useful": 16, "cool": 12}, "user_id": "iWE4gOBIblCtEMOaq67Z7g", "name": "Madhur A.", "url": "http://www.yelp.com/user_details?userid=iWE4gOBIblCtEMOaq67Z7g", "average_stars": 3.8181818181818201, "review_count": 22, "type": "user"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TdANE88PQCEGeTtdsesb2w", "name": "Christina B.", "url": "http://www.yelp.com/user_details?userid=TdANE88PQCEGeTtdsesb2w", "average_stars": 5.0, "review_count": 1, "type": "user"}
{"votes": {"funny": 2715, "useful": 3982, "cool": 3212}, "user_id": "wCtf5_zG8EpWiBp_Oi7P0g", "name": "Sarah G.", "url": "http://www.yelp.com/user_details?userid=wCtf5_zG8EpWiBp_Oi7P0g", "average_stars": 3.4517470881863601, "review_count": 1202, "type": "user"}
